Repository: jmbowman/portabase
Catalog: resources/help/translations/*/calculation_editor.po
Languages: cs, fr, ja, zh_tw

source: Calculation editor
cs: Editor výpočtů
fr: Editeur de calcul
ja: 計算値編集画面
zh_tw: 運算式編輯器

source: This dialog allows you to define columns which contain values calculated from the values of other columns in the same row. It is launched by pressing the "Edit calculation" button in the column editor, which appears only for columns of type "Calculation". At the top of the dialog are the name of the column, a read-only display of the current calculation written as a one-line expression, and a spin box that allows you to specify how many decimal places should be shown for the calculation results.
cs: Tento dialog umožňuje nadefinovat sloupce obsahující hodnoty vypočtené z hodnot jiných sloupců stejného záznamu. Editor výpočtů lze vyvolat pouze u sloupců typu výpočet v Editoru sloupců po stisku tlačítek "Editovat" a následně "Editovat výpočet". V horní části dialogu nalezneme jméno sloupce, needitovatelné jednořádkové zobrazení stávajícího výpočtu a volbu počtu desetinných míst udávajících přesnost výpočtu.
fr: Cette boite de dialogue vous permet de définir les colonnes qui contiendront des valeurs calculées à partir du contenu d'autres colonnes de la même ligne. Il est lancé en cliquant sur le bouton "Modifier le calcul" dans l'éditeur de colonne, lequel apparaît uniquement pour les colonnes de type "Calcul". En haut de la boite de dialogue se trouvent le nom de la colonne, l'affichage du calcul courant écrit sous la forme d'une expression sur une seule ligne et une zone de saisie qui vous permet de spécifier combien de décimales doivent être affichées pour le résultat du calcul.
ja: このダイアログで、同じレコードの他のフィールドの値からの算出値を持つフィールドを定義できます。フィールドエディタ画面で"計算編集"ボタンを押すと起動するダイアログで、フィールドタイプが"計算値"の時にのみ表示されます。このダイアログの最上部にはフィールド名、読み取り専用の１行の数式で表した現在の数式の表示部、計算結果を何桁まで表示するかを選択するスピンボックスがあります。
zh_tw: 你可以使用此對話盒來定義計算欄位，其內容可由同一列的其他欄位值做運算後獲得。在欄位編輯器中按下"編輯運算式"鈕可以叫出此對話盒，但只限於型別為"運算式"的欄位。在對話盒上方有此欄位的名稱，目前運算式的唯讀顯示，以及一個用來設定計算結果小數點位數的旋轉盒。

source: Most of the dialog is filled by a widget which shows the current calculation as a tree, similar to many file explorer programs. Each node in the tree represents either the value of another column, a constant value, or the result of an operation. To edit the calculation, select a node from the tree (if any are present) and use the buttons in the dialog:
cs: Největší část dialogu zabírá zobrazení stromové struktury stávajího výpočtu v podobě známé např. ze souborových správců. Každá větev stromu představuje buď hodnotu některého sloupce, konstantu nebo výsledek početní operace. Chcete-li výpočet editovat, vyberte příslušnou větev (je-li dostupná) a použijte tlačítka z dolní části dialogu:
fr: La plus grande partie de la boit de dialogue est remplie par un composant graphique qui montre le calcul actuel sous forme d'un arbre, similaire à un explorateur de fichiers. Chaque noeud de l'arbre représente soit la valeur d'une autre colonne, soit une valeur constante ou bien le résultat d'une opération. Pour modifier le calcul, sélectionnez un noeud de l'arbre (s'il y en a) et utilisez les boutons de la boite de dialogue :
ja: ダイアログの大部分は多くのファイルエクスプローラにも似た、ツリー状に現在の計算式を表示するウィジェットで占められています。ツリー上のノードはそれぞれ、他のフィールドの値、定数,または演算子のいずれかを表示しています。計算式を編集するには、（もし既にあれば）ツリーからノードを選択し、ダイアログのボタンを使用します:
zh_tw: 運算式是以樹狀圖來顯示，與檔案總管這一類的程式類似。樹狀圖中的每個節點可以是某個欄位的值、一個常數或是運算式的結果。要編輯運算式的話，由樹狀圖中選定一個節點(如果有的話)並使用對話盒底部的按鈕：

source: **Add**
cs: **Přidat**
fr: **Ajouter**
ja: **作成**
zh_tw: **新增**

source: Add a new node as a child of the currently selected node; a dialog will appear which allows you to select the type and value of the node.
cs: Přidá novou větev jako podřízenou větve vybrané; objeví se dialog umožňující výběr typu operace a hodnoty.
fr: Ajoute un nouveau noeud fils du noeud actuellement sélectionné ; une boite de dialogue s'affichera et vous permettra de sélectionner le type et la valeur du noeud.
ja: 新しいノードを、現在選択しているノードの子として追加します: ノードの値のタイプを選択するためのダイアログが表示されます。
zh_tw: 新增一個子節點至目前選定的節點; 你可以使用出現的對話盒來設定此節點的型別與值。

source: **Edit**
cs: **Editovat**
fr: **Modifier**
ja: **編集**
zh_tw: **編輯**

source: Edit the selected node.
cs: Umožní editaci vybrané větve.
fr: Modifier le noeud sélectionné.
ja: 選択されているノードを編集します。
zh_tw: 編輯目前選定的節點。

source: **Delete**
cs: **Smazat**
fr: **Supprimer**
ja: **削除**
zh_tw: **刪除**

source: Delete the currently selected node.
cs: Smaže vybranou větev.
fr: Supprime le noeud actuellement sélectionné.
ja: 選択されているノードを削除します。
zh_tw: 刪除目前選定的節點。

source: **Up**
cs: **Posunout nahoru**
fr: **Monter**
ja: **上げる**
zh_tw: **往上**

source: Move the currently selected node up among its siblings.
cs: Posune vybranou větev o jednu pozici výše mezi větvemi stejné úrovně.
fr: Déplace le noeud actuellement sélectionné d'une position vers le haut.
ja: 選択されているノードをその兄弟の間で上に移動します。
zh_tw: 將目前選定的節點在他的同一層級節點中的位置往上移動。

source: **Down**
cs: **Posunout dolů**
fr: **Descendre**
ja: **下げる**
zh_tw: **往下**

source: Move the currently selected node down among its siblings.
cs: Posune vybranou větev o jednu pozici níž mezi větvemi stejné úrovně.
fr: Déplace le noeud actuellement sélectionné d'une position vers le bas.
ja: 選択されているノードをその兄弟の間で下に移動します。
zh_tw: 將目前選定的節點在他的同一層級節點中的位置往下移動。

source: Usually you want to start by adding an operation node, such as "+", and then add its arguments (which may themselves be operations with arguments of their own). The buttons automatically update when a node is selected in order to indicate which actions are possible; typical actions not allowed are:
cs: Doporučujeme začít výběrem početní operace (např. "+") a následným přidáváním jejích argumentů (kterými mohou být i operace s jejich vlastními argumenty). V závislosti na tom, jaká větev je vybrána, se mění i dostupná tlačítka; typickými nepovolenými akcemi jsou:
fr: Habituellement, vous désirez démarrer en ajoutant un noeud opération, tel que "+", et ensuite vous ajoutez ses arguments (qui peuvent eux-mêmes être des opérations avec leurs propres arguments). Les boutons se mettent à jour automatiquement quand un noeud est sélectionné afin d'indiquer quelles actions sont possible ; typiquement les actions non permises sont :
ja: 通常は、例えば"+"などの演算子ノードの追加から始め、その引き数（それ自身も引き数を持った演算子ノードでも構いません）を追加します。ボタンは、現在選択されているノードに対してそのアクションが実行できる時には、自動的に更新されます; 許可されないアクションは、例えば次のようなものです:
zh_tw: 通常你會先新增一個運算式節點, 例如 "+", 然後再新增它的參數 (這些參數也可能是一個運算式)。當選定一個節點時，按鈕會自動更新狀態來顯示你可採取的動作；常見不被允許的動作如下：

source: Adding a child node to an operation which already has as many arguments as it can use
cs: Přidání podřízené větve operaci s již dosaženým maximálním počtem argumentů
fr: Ajouter un noeud enfant à une opération qui a déjà le maximum d'arguments possible
ja: 演算子ノードが既に扱える最大の個数の引き数を持っている時の、子ノードの追加。
zh_tw: 一個運算子節點已經擁有所需的參數時，你無法再新增一個子節點

source: Editing an operation node; it must be deleted and replaced instead
cs: Změna typu početní operace; změnu lze provést jen smazáním a nahrazením stávající operace
fr: Modifier un noeud opération ; il doit plutôt être supprimé puis recréé
ja: 演算子ノードの編集; 編集した値は削除され、代替値で置き換えられます。
zh_tw: 編輯運算式節點；你只能刪除後再建立新的

source: Moving a node up or down when it cannot move further in that direction
cs: Posun větve nahoru či dolů, nelze-li již větev daným směrem dále posunovat
fr: Déplacer un noeud (vers le haut ou le bas) alors qu'il ne peut pas aller plus loin dans cette direction
ja: その方向にそれ以上動かせない時のノードの"上げる"と"下げる"。
zh_tw: 當節點已經在盡頭時，你不能再往該方向移動

source: Some points worth noting:
cs: Důležité připomínky:
fr: Quelques remarques complémentaires :
ja: 以下は蛇足ですが:
zh_tw: 一些注意事項：

source: Only columns of type Integer, Decimal, Sequence, and Boolean can be used in calculations. Additionally, Date columns can be used as children of a "Days_Between" operation, and Time columns can be used as children of "Seconds_Between", "Minutes_Between", and "Hours_Between" operations.
cs: Pro výpočty lze použít jen sloupce typu integer, decimální, sekvence a booleánský. Navíc je možné použít sloupce typu datum jako podřízené pro operaci "Počet_dnů_mezi" a sloupce typu čas jako podřízené pro operace "Počet_sekund_mezi", "Počet_minut_mezi" a "Počet_hodin_mezi".
fr: Seules les colonnes de type Entier, Decimal, Séquence et Booléen peuvent être utilisées dans les calculs. De plus, les colonnes de type Date peuvent être utilisées en tant qu'enfant d'une opération "Days_Between" et les colonnes de type Heure peuvent être utilisées en tant qu'enfant des opérations "Seconds_Between", "Minutes_Between" et "Hours_Between".
ja: 計算には、整数値、数値、番号、真偽フィールドを使うことができます。加えて、日付フィールドを"Days_Between"操作の時に、時刻フィールドを"Seconds_Between"、"Minutes_Between"、それから"Hours_Between"フィールドで使うことができます。
zh_tw: 只有下列欄內型別可以用來計算：整數，小數值，真或假值，連續值等。 另外，日欄可以用作日期間操作之子值，而時間欄可以作為秒間和分間和時間操作的子值

source: Calculation columns cannot be used in other calculations, since this would introduce a variety of complications. You can get the same effect by repeating the definition of a calculation as part of another one.
cs: Sloupce typu výpočet nelze použít pro jiné výpočty z důvodu předcházení nejrůznějším komplikacím. Stejného výsledku lze dosáhnout opakovaným použitím stejné definice jako součásti jiného výpočtu.
fr: Les colonnes de type Calcul ne peuvent pas être utilisées dans d'autres calculs puisque cela pourrait introduire une certaine complexité. Vous pouvez obtenir le même effet en répétant la définition du calcul dans un autre.
ja: 計算値フィールドは、さまざまな複合問題を引き起こしかねないので、他の計算値フィールドでは使えません。同じ効果は、計算値の定義を他の計算値の一部として繰り返すことで得られます。
zh_tw: 計算欄位不得用於其他計算欄位中，因為這樣會過於複雜。如有需要的話，你可以將該計算欄位的運算式加入到另一計算欄位的運算式中。

source: Operations which haven't been given enough (or any) arguments usually return zero.
cs: Operace s nedostatkem (či bez) argumentů obvykle vracejí nulu.
fr: Les opérations qui n'ont pas assez d'arguments retournent habituellement zéro.
ja: 操作に必要なだけの引き数が（あるいは引き数が全く）渡されなかった場合は、通常、０が返されます。
zh_tw: 未給予參數或參數不足的運算式結果通常是0。

source: If a column is renamed or deleted using the columns editor, any calculations using it are automatically updated accordingly.
cs: Byl-li sloupec v Editoru sloupců přejmenován či smazán, jsou výpočty, které jej používají, podle toho automaticky zaktualizovány.
fr: Si une colonne est renommée ou supprimée en utilisant l'éditeur de colonnes, tout calcul s'y référant sera mis à jour automatiquement.
ja: フィールドエディタでフィールド名が変更された時やフィールドが削除された時は、いずれの計算値も変更内容にしたがって自動的に更新されます。
zh_tw: 如果你使用欄位編輯器將某個欄位更改名稱或刪除，任何使用到該欄位的運算式會依情況自動更新。
