Repository: jmbowman/portabase
Catalog: resources/help/translations/*/columns_editor.po
Languages: cs, fr, it, ja, zh_tw

source: Columns editor
cs: Editor sloupců
fr: Editeur de colonnes
it: Editor di colonne
ja: フォーマット編集画面
zh_tw: 欄位編輯器

source: Each PortaBase file contains one table of a user-defined format. The format of this table is determined by a sequence of data columns, each of which has its own name, data type, and default value. When creating a new PortaBase file, this dialog is shown so the data columns can be defined. The columns of an existing file can also be edited at any time using this dialog by selecting the "Edit Columns" menu item (in the :ref:`data viewer <data_viewer>`, under the "File" menu except on Maemo where the menus are flattened).
cs: Každý soubor aplikace PortaBase obsahuje jednu tabulku s formátem definovaným uživatelem. Formát tabulky je určen posloupností datových sloupců, z nichž každý má své vlastní jméno, datový typ a výchozí hodnotu. Při vytváření nového souboru aplikace PortaBase je vždy zobrazen dialog Editoru sloupců umožňující uživateli definovat datové sloupce. Sloupce již existujícího souboru lze kdykoli změnit výběrem volby "Editor sloupců" (v :ref:`Prohlížeči dat <data_viewer>` z menu "Soubor" - kromě přístrojů Maemo, kde jsou menu zjednodušena).
fr: Chaque fichier Portabase contient une seule table dont le format est défini par l'utilisateur. Le format de cette table est déterminé par une succession de colonnes, chacune ayant son propre nom, type et valeur par défaut. Lors de la création d'une nouveau fichier Portabase, cette boite de dialogue est affichée afin de permettre la création des colonnes. Les colonnes d'un fichier existant peuvent aussi être modifiées à n'importe quel moment en utilisant cette boite de dialogue en choisissant le menu "Modifier les colonnes" (dans :ref:`l'afficheur de données <data_viewer>`, du menu "Fichier", excepté sous Maemo où les menus sont aplatis).
it: Ogni file PortaBase contiene una singola tabella di formato definito dall'utente. Il formato di questa tabella è determinato da una successione di colonne di dati, ciascuna delle quali ha il suo nome, tipo di dati e valore di default. Quando si crea un nuovo file PortaBase, questa finestra di dialogo viene mostrata in modo tale che si possano definire le colonne di dati. Le colonne di un file esistente possono essere editate in ogni momento da questa finestra di dialogo, selezionando la voce di menu "Edita colonne" (nel :ref: `visualizzatore dati <data_viewer>`presente nel menu "File", tranne che su Maemo dove i menu sono su un unico livello).
ja: PortaBaseファイルはそれぞれ、ユーザーが定義したフォーマットのテーブルを1つ含んでいます。このテーブルのフォーマットは一連のデータフィールドから決定されており、フィールドはそれぞれ名前、データタイプ、デフォルト値を持っています。PortaBaseファイルの新規作成時にはこのダイアログが表示され、データフィールドを定義することができます。既存のファイルのフィールドもいつでも、\ :ref:`データ表示画面 <data_viewer>`\ の"ファイル"メニューの"フォーマット編集"を選択し、このダイアログを使って編集できます。（メニューの構成が簡単なMaemoでは、このオプションは"ファイル"メニューの下ではなく、直接メニューに入っている。）
zh_tw: 每一個在PortaBase 內的檔案都含有使用考設定的表格式。這些表格式是一連續的數據欄位來決定，每一個格式都有它自己的名稱，數據類型，和默認值。每當建立一個新的PortaBase 檔案，這對話器就會顯示讓你可以設定你的數據欄位表。巳經存在的數據欄位任何時間都可以用此對話器來修訂只要點擊選項裡的 "編輯欄位" 即可（在:ref:'數據流灠器＜data_viewer>', 在"檔案"項目下面）

source: The current column definitions are displayed as rows in a list, in the order in which they appear in the :ref:`row editor <row_editor>`. These column definitions are manipulated using the buttons in the dialog:
cs: Stávající definice sloupců jsou zde zobrazeny ve stejném pořadí jako v :ref:`Editoru záznamů <row_editor>`. S definicemi sloupců lze nakládat pomocí tlačítek v dolní části Editoru sloupců:
fr: Les définitions de colonnes courantes sont affichées en ligne dans une liste, dans l'ordre dans lequel elles apparaissent dans :ref:`l'éditeur de ligne <row_editor>`. Ces définitions de colonne sont gérées en utilisant les boutons de la boite de dialogue :
it: Le definizioni della colonna attuale sono visualizzate come righe in una lista, nell'ordine in cui appaiono nell' :ref: `editor di riga <row_editor>`. Tali definizioni di colonna sono manipolabili usando i pulsanti della finestra di dialogo:
ja: 現在のフィールド定義が１フィールドにつき１行の形で、\ :ref:`レコード編集画面 <row_editor>`\ で表示されるのと同じ順番で一覧表示されます。これらのフィールド定義は、ダイアログのボタンを使って操作することができます:
zh_tw: 欄位的定義會依照他們在\ :ref:`列編輯器 <row_editor>`\ 中的順序排列成一個清單。這些欄位的定義可利用此對話盒底部的按鈕來加以處理：

source: **Add**
cs: **Přidat**
fr: **Ajouter**
it: **Aggiungi**
ja: **作成**
zh_tw: **新增**

source: Create a new column definition at the end of the list. A small dialog is shown which allows you to enter the name, data type, and default value of the new column. (If you select "(New Enum)" from the type list in this dialog, the :ref:`enum editor <enum_editor>` will be launched to allow you to add one.) The default value is what will be entered for this column in any already existing data rows, and it will appear in the row editor when adding new rows as well.
cs: Vytvoří novou definici sloupce a přidá ji na konec přehledu. Pomocí zobrazeného dialogu uživatel zadá jméno, datový typ a výchozí hodnotu nového sloupce. (Vyberete-li jako typ příslušného sloupce v tomto dialogu "(Nový seznam)", spustí se :ref:`Editor seznamů <enum_editor>`, který Vám umožní nový seznam vytvořit.) Výchozí hodnota je údaj, který bude použit v daném sloupci u již existujících záznamů a současně bude použit v Editoru záznamů u nově přidávaných záznamů jako přednastavený údaj.
fr: Crée une nouvelle définition de colonne à la fin de la liste. Une boite de dialogue est affichée vous permettant de saisir le nom, le type et la valeur par défaut de la nouvelle colonne. (Si vous sélectionner "(Nouvelle énumération)" depuis la liste des types dans cette boite de dialogue, :ref:`l'éditeur d'énumération <enum_editor>` sera affiché vous permettant d'en ajouter une). La valeur par défaut est celle qui sera affectée à cette colonne pour chacune des lignes déjà existante et celle qui apparaîtra dans l'éditeur de ligne lors de l'ajout d'une nouvelle ligne.
it: Crea una nuova definizione di colonna in fondo alla lista. Appare una piccola finestra di dialogo che permette di inserire il nome, il tipo di dati e il valore di default per la nuova colonna. (Se selezioni "(Nuova Enum)" dalla lista di tipi in questa finestra di dialogo, l' :ref: `editor di enumerazioni <enum_editor>` viene lanciato, permettendoti di aggiungere un'enumerazione). Il valore di default è quello che viene inserito nella colonna in tutte le righe di dati già esistenti, e apparirà anche nell'editor di riga quando verranno aggiunte altre righe.
ja: リストの最後に新しいフィールド定義を作成します。名前、データタイプ、そしてデフォルト値を入力するための小さなダイアログが表示されます。（もしこのダイアログのタイプリストから"(新しい列挙)"を選択した場合、これを追加するための\ :ref:`列挙編集画面 <enum_editor>`\ が起動されます。）デフォルト値は、既存のデータレコードのこのフィールドに入力され、新しいレコードを追加する時にもレコード編集画面に表示されます。
zh_tw: 在清單尾建立一個新的欄位定義。你可以使用出現的對話盒來輸入新欄位的名稱、資料型別與預設值。(如果你在型別設定選擇"(新集合)"，則你可以使用\ :ref:`集合編輯器 <enum_editor>`\ 來新增一個集合。) 所有已存在的資料列會自動將此欄位的預設值設定為欄位的內容。同時在列編輯器中新增資料時，預設值會出現在此欄位中。

source: **Edit**
cs: **Editovat**
fr: **Modifier**
it: **Modifica**
ja: **編集**
zh_tw: **編輯**

source: Edit the currently selected column definition. Note that the data type cannot be changed. If the default value is changed, the new default will appear in the row editor when adding new rows; existing rows are unaffected.
cs: Umožní editaci vybrané definice sloupce. Jednou zvolený datový typ sloupce však již nelze změnit. Je-li změněna výchozí hodnota, nově nastavená výchozí hodnota se objeví v Editoru záznamů u nově přidávaných záznamů; již existující záznamy přitom nebudou změnou ovlivněny.
fr: Modifier la définition de colonne actuellement sélectionnée. Remarquez que le type de données ne peut être changé. Si la valeur par défaut est modifiée alors la nouvelle valeur apparaîtra dans l'éditeur d eligne lors de l'ajout d'une nouvelle ligne ; les lignes existantes ne seront pas affectées.
it: Modifica la definizione di colonna attualmente selezionata. Nota che il tipo di dati non può essere modificato. Se il valore di default viene cambiato, quello nuovo apparirà nell'editor di riga quando si aggiungono nuove righe: quelle esistenti non vengono modificate.
ja: 選択されているフィールド定義を編集します。データタイプは変更できないことに注意してください。デフォルト値が変更されると、この新しいデフォルト値が新規レコード作成時のレコード編集画面で表示されます; 既存のレコードには影響しません。
zh_tw: 編輯目前選定之欄位定義。但是你不能變更資料型別。如果預設值有所改變，在列編輯器中新增資料列時出現的是新的值，已存在的資料料內容則不受影響。

source: **Delete**
cs: **Smazat**
fr: **Supprimer**
it: **Elimina**
ja: **削除**
zh_tw: **刪除**

source: Delete the currently selected column definition. All data stored in that column will be lost.
cs: Smaže vybranou definici sloupce. Veškeré údaje uchovávané v takovém sloupci budou přitom ztraceny.
fr: Supprime la définition de colonne actuellement sélectionnée. Toutes les données stockées dans cette colonne seront perdues.
it: Elimina la definizione di colonna attualmente selezionata. Tutti i dati contenuti in tale colonna verranno persi.
ja: 選択されているフィールド定義を削除します。このフィールドに入力されているデータはすべて失われます。
zh_tw: 刪除目前選定之欄位定義。該欄位對應的所有資料都會不見。

source: **Up**
cs: **Posunout nahoru**
fr: **Monter**
it: **Su**
ja: **上げる**
zh_tw: **往上**

source: Move the currently selected column up one position in the list (and hence in the row editor as well).
cs: Posune vybraný sloupec v seznamu Editoru sloupců o jednu pozici výše (a současně také v Editoru záznamů).
fr: Déplace la définition de colonne actuellement sélectionnée vers le haut (et par conséquent dans l'éditeur de ligne également).
it: Sposta una posizione più in alto nella lista (e quindi nell'editor di riga) la colonna attualmente selezionata.
ja: 選択されているフィールドのリスト上での位置を一つ上げます（それに伴って、レコード編集画面上でも一つ上の位置に表示されます）。
zh_tw: 將目前選定的欄位往上移動一個位置(在列編輯器中的位置也會隨之變更)。

source: **Down**
cs: **Posunout dolů**
fr: **Descendre**
it: **Giù**
ja: **下げる**
zh_tw: **往下**

source: Move the currently selected column down one position in the list (and hence in the row editor as well).
cs: Posune vybraný sloupec v seznamu Editoru sloupců o jednu pozici níž (a současně také v Editoru záznamů).
fr: Déplace la définition de colonne actuellement sélectionnée vers le bas (et par conséquent dans l'éditeur de ligne également).
it: Sposta una posizione più in basso nella lista (e quindi nell'editor di riga) la colonna attualmente selezionata.
ja: 選択されているフィールドのリスト上での位置を一つ下げます（それに伴って、レコード編集画面上でも一つ下の位置に表示されます）。
zh_tw: 將目前選定的欄位往下移動一個位置(在列編輯器中的位置也會隨之變更)。

source: None of the changes made to the table format are applied until the "OK" ("Done" on Maemo Fremantle) button is pressed; if the dialog is exited by cancelling instead, the changes are discarded and the file format is left as it was. If the dialog is cancelled while defining the columns of a new file, the file creation is aborted; otherwise, exiting the dialog takes you to the :ref:`data viewer <data_viewer>`.
cs: Žádná ze změn ve formátu tabulky není provedena dříve, než ji uživatel potvrdí volbou "OK" ("Done" na Maemo Fremantle); je-li použita volba "Zrušit" či křížek pro uzavření dialogu, veškeré změny jsou zrušeny a původní formát souboru je ponechán beze změny. Volba "Zrušit" či křížek pro uzavření dialogu při definování sloupců nového souboru vytváření souboru zruší. Uzavřením dialogu se přeneseme zpět do :ref:`Prohlížeče dat <data_viewer>`.
fr: Aucun des changements réalisés à la structure de la table n'est appliqué tant que le bouton "OK" ("Fait" sur Maemo Fremantle) n'est pas cliqué ; si par contre la boite de dialogue est fermée par le bouton "Annuler" alors les changements sont perdus et la structure du fichier reste inchangé. Si la boite de dialogue est fermée par le bouton "Annuler" lors de la définition de colonnes pour un nouveau fichier alors la création de ce fichier est annulée , sinon :ref:`l'afficheur de données <data_viewer>` est affiché.
it: Nessuna delle modifiche fatte al formato della tabella verrà applicata fino a quando non viene cliccato il pulsante "OK" ("Done" sul Maemo Fremantle); se si esce dalla finestra di dialogo con un "Cancella", le modifiche sono scartate e il formato del file lasciato come era in origine. Se la finestra di dialogo viene cancellata mentre si stanno definendo le colonne di un nuovo file, la creazione del file è abortita; altrimenti, uscire dalla finestra di dialogo porta al :ref: `visualizzatore di dati <data_viewer>`.
ja: テーブルフォーマットに行った変更は、"OK"ボタンが押されるまでは適用されません: 代りにキャンセルするのを選ぶと、変更は破棄され、元々のファイルのフォーマットが残されます。新規ファイルのフィールド定義注にキャンセルする場合、ファイル作成はアボートされます; それ以外の時は、どちらかのダイアログクローズボタンを押すと\ :ref:`データ表示画面 <data_viewer>`\ に移ります。
zh_tw: 沒有任何格式表的修改會被應用上直到你點擊"OK" 按鈕（在Maemo 系統上是"Done"); 如果對話器登出是因為被取消，則所有改變將被丟棄且檔案格式將維持如未被修改前。如果對話被取消時你正在給新檔案設定欄位格式時，則新檔建立將被中止；否則，登出對話將帶你到數據流灠處 :ref:'數據流灠器＜data_viewer>'.
