Repository: jmbowman/portabase
Catalog: resources/help/translations/*/command_line.po
Languages: cs, fr, it, ja, zh_tw

source: Command line usage
cs: Terminál/příkazový řádek
fr: Utilisation de la ligne de commande
it: Uso da linea di comando
ja: コマンドラインでの使い方
zh_tw: 命令列用法

source: PortaBase can be used from a Linux/UNIX terminal or DOS prompt to import or export data without needing to go through the graphical interface. This can be particularly useful if you want to write scripts that automatically generate, update, or otherwise manipulate PortaBase data files. Run ``portabase -h`` for usage instructions; in summary, you can do the following:
cs: Aplikace PortaBase podporuje přímo z terminálu Linuxu/přístroje Zaurus či příkazového řádku DOSu import a export dat bez nutnosti použití grafického rozhraní aplikace. Tato vlastnost je důležitá pro tvorbu skriptů pro automatické generování, aktualizace nebo jiné úpravy datových souborů PortaBase. Nápovědu k použití příkazového řádku či terminálu vyvoláte příkazem ``portabase -h``; ve zkratce přinášíme stručný přehled příkazů:
fr: PortaBase peut être utilisé à partir d’un terminal Linux / UNIX ou d’une invite DOS pour importer ou exporter des données sans passer par l’interface graphique. Cela peut être particulièrement utile si vous souhaitez écrire des scripts qui génèrent, mettent à jour ou manipulent automatiquement les fichiers de données PortaBase. Exécutez `` portabase -h`` pour les instructions d'utilisation; en résumé, vous pouvez effectuer les opérations suivantes:
it: PortaBase può essere usato da un terminale Linux/UNIX o da una finestra DOS per importare o esportare dati senza dover passare dall'interfaccia grafica. Questo può essere particolarmente utile se vuoi creare script che generano, aggiornano o manipolano automaticamente i file di dati PortaBase. Lancia ``portabase -h`` per le istruzioni; in breve, puoi compiere le seguenti operazioni:
ja: PortaBaseはLinux/UNIXのターミナルやDOSプロンプトから使用し、グラフィカル・インターフェース抜きでデータをインポート/エクスポートすることができます。これは、PortaBaseのデータファイルを生成し、更新し、その他の操作をするようなスクリプトを書く時には非常に便利です。\ ``portabase -h``\ を実行すると、使い方の説明が表示されます; 概要としては、以下ができます:
zh_tw: PortaBase可以不需藉由圖形介面直接從Linux/UNIX終端機或DOS模式下來匯入或匯出資料。在你撰寫命令稿以便自動產生、更新、或處理PortaBase資料檔時，這一點特別有用。執行\ ``portabase -h``\ 可得到用法說明; 總之，你可以達成下列功能：

source: Launch PortaBase and immediately open the named PortaBase data file.
cs: Spustí aplikaci PortaBase a současně jí otevře specifikovaný soubor PortaBase.
fr: Lancez PortaBase et ouvrez immédiatement le fichier de données nommé PortaBase.
it: Lancia PortaBase e apre immediatamente il file dati con il nome indicato.
ja: PortaBaseを起動し、すぐに指定された名前のPortaBaseデータファイルを開きます。
zh_tw: 啟動 PortaBase並立即打開名為資料檔。

source: Create a new PortaBase data file at *pobfile* from the PortaBase-format XML file located at *xmlfile*.
cs: Vytvoří nový soubor PortaBase v *soubor_pob* ze souboru ve formátu PortaBase XML nacházejícího se v *soubor_xml*.
fr: Créez un nouveau fichier de données PortaBase sur * pobfile * à partir du fichier XML au format PortaBase situé sur * xmlfile *.
it: Crea un nuovo file dati PortaBase a *pobfile*, partendo dal file XML in formato PortaBase trovato a *xmlfile*.
ja: *xmlfile*\ で指定されたPortaBase形式のXMLファイルから、\ *pobfile*\ で指定された新しいPortaBaseのデータファイルを生成します。
zh_tw: 由名為\ *xmlfile*\ 符合PortaBase XML格式的檔案，匯入資料成一個名為\ *pobfile*\ 的新PortaBase資料檔。

source: Add rows to the existing PortaBase data file at *pobfile* from the CSV file located at *csvfile*.
cs: Přidá záznamy ke stávajícímu souboru PortaBase v *soubor_pob* ze souboru CSV nacházejícího se v *soubor_csv*.
fr: Fichier de données PortaBase à * pobfile * à partir du fichier CSV situé
it: Aggiunge righe al file dati PortaBase esistente a *pobfile*, prendendole dal file CSV che si trova a *csvfile*.
ja: *csvfile*\ で指定されたCSVファイルから、\ *pobfile*\ で指定された既存のPortaBaseデータファイルにレコードを追加します。
zh_tw: 由名為\ *csvfile*\ 的CSV檔匯入資料，新增至名為\ *pobfile*\ 的PortaBase資料檔。

source: Create a new PortaBase data file at *pobfile* from the MobileDB file located at *mdbfile*.
cs: Vytvoří nový soubor PortaBase v *soubor_pob* ze souboru MobileDB nacházejícího se v *soubor_mdb*.
fr: Créez un nouveau fichier de données PortaBase sur * pobfile * à partir du fichier MobileDB situé sur * mdbfile *.
it: Crea un nuovo file dati PortaBase a *pobfile*, partendo dal file MobileDB trovato a *mdbfile*.
ja: *mdbfile*\ で指定されたMobileDBファイルから、\ *pobfile*\ で指定された新しいPortaBaseのデータファイルを生成します。
zh_tw: 由名為\ *mdbfile*\ 的MobileDB檔案，匯入資料成一個名為\ *pobfile*\ 的新PortaBase資料檔。

source: Create a new XML file at *xmlfile* from the PortaBase data file located at *pobfile*.
cs: Vytvoří nový soubor XML v *soubor_xml* ze souboru PortaBase nacházejícího se v *soubor_pob*.
fr: Créez un nouveau fichier XML dans * xmlfile * à partir du fichier de données PortaBase situé dans * pobfile *.
it: Crea un nuovo file XML a *xmlfile*, partendo dal file dati PortaBase trovato a *pobfile*.
ja: *pobfile*\ で指定されたPortaBaseのデータファイルから\ *xmlfile*\ で指定された新しいXMLファイルを生成します。
zh_tw: 由名為\ *pobfile*\ 的PortaBase資料檔，將資料匯出成一個名為\ *xmlfile*\ 的新XML檔。

source: Create a new CSV file at *csvfile* from rows in the PortaBase data file located at *pobfile*.
cs: Vytvoří nový soubor CSV v *soubor_csv* ze záznamů souboru PortaBase nacházejícího se v *soubor_pob*.
fr: Créez un nouveau fichier CSV sur * csvfile * à partir de lignes du fichier de données PortaBase situé sur * pobfile *.
it: Crea un nuovo file CSV a *csvfile*, partendo dalle righe del file dati PortaBase trovato a *pobfile*.
ja: *pobfile*\ で指定されたPortaBaseのデータファイル内のレコードから\ *csvfile*\ で指定された新しいCSVファイルを生成します。
zh_tw: 由名為\ *pobfile*\ 的PortaBase資料檔，將資料匯出成一個名為\ *csvfile*\ 的新CSV檔。

source: Create a new HTML file at *htmlfile* from rows in the PortaBase data file located at *pobfile*.
fr: Créez un nouveau fichier HTML dans * htmlfile * à partir de lignes du fichier de données PortaBase situé dans * pobfile *.
it: Crea un nuovo file HTML a *htmlfile*, partendo dalle righe del file dati PortaBase trovato a *pobfile*.
ja: *pobfile*\ で指定されたPortaBaseのデータファイル内のレコードから\ *htmlfile*\ で指定された新しいHTMLファイルを生成します。
zh_tw: 在PortaBase放在"pobfile*"裡面的資料檔案上裡面的列位表上建立一個新的HTML 檔案放在"htmlfile"。

source: To extract data from, add rows to, or create an encrypted file, type :samp:`-p {password}` immediately after the conversion command (before the other options described below).
cs: Chcete-li získat data ze šifrovaného souboru, přidat záznamy do šifrovaného souboru nebo vytvořit nový šifrovaný soubor, je nezbytné bezprostředně za konverzním příkazem (tzn. před dalšími volbami uvedenými níže) :samp:`-p {heslo}`.
fr: Pour extraire des données, ajouter des lignes ou créer un fichier crypté, tapez: samp: `-p {mot de passe}` immédiatement après la commande de conversion (avant les autres options décrites ci-dessous).
it: Per estrarre dati da, aggiungere righe a, o creare un file crittato, digita :samp:`-p {password}` immediatamente dopo il comando di conversione (prima delle altre opzioni descritte sotto)
ja: 暗号化済みファイルからのデータの抽出、暗号化済みファイルへのレコード追加、暗号済みファイルの生成には、変換コマンドの直後（以下に示す他のオプションの前）に\ :samp:`-p {password}`\ と入力します。
zh_tw: 要產生加密檔或從中取出資料或新增資料列時，緊接在轉換的命令後輸入\ :samp:`-p {密碼}`\ (在下面所述的選項之前)。

source: The following options can be used between ``toxml``, ``tocsv``, or ``tohtml`` and the PortaBase file to export from:
fr: Les options suivantes peuvent être utilisées entre `` toxml``, `` tocsv`` ou `` tohtml`` et le fichier PortaBase à exporter:
it: Le opzioni seguenti possono essere usate con ``toxml``, ``tocsv``, o ``tohtml``, e il file PortaBase da cui esportare:
ja: ``toxml``\ 、\ ``tocsv``\ 、または\ ``tohtml``\ とエクスポート元になるPortaBaseファイル名の間に、以下のオプションを入れることができます:
zh_tw: 下面的選項內可以運用在 上傳檔案到PortaBase裡："toxml", "tocsv", "tohtml"。

source: Apply the named view before exporting.
cs: Před exportem použije specifikovaný náhled.
fr: Appliquez la vue nommée avant d'exporter.
it: Applica la vista indicata prima di esportare.
ja: エクスポートの際に指定されたビューを適用します。
zh_tw: 匯出前先套用指定的景觀

source: Apply the named sorting before exporting.
cs: Před exportem použije specifikované pořadí.
fr: Appliquez le tri nommé avant l'exportation.
it: Applica l'ordine indicato prima di esportare.
ja: エクスポートの前に指定されたソーティングを適用します。
zh_tw: 匯出前先套用指定的排序方式

source: Apply the named filter before exporting.
cs: Před exportem použije specifikovaný filtr.
fr: Appliquez le filtre nommé avant l'exportation.
it: Applica il filtro indicato prima di esportare.
ja: エクスポートの前に指定されたフィルターを適用します。
zh_tw: 匯出前先套用指定的篩選

source: The following options can be used with either ``fromcsv`` or ``tocsv``:
fr: Les options suivantes peuvent être utilisées avec `` fromcsv`` ou `` tocsv``:
it: Le opzioni seguenti possono essere usate con ``fromcsv`` oppure ``tocsv``:
ja: ``fromcsv``または``tocsv``とファイル名の間に、以下のオプションを入れることが出来ます：

source: There is or should be a row of column headers
fr: Il y a ou devrait être une rangée d'en-têtes de colonne
it: C'è o ci dovrebbe essere una riga di header per le colonne
ja: CSVファイルにフィールドラベルのレコードが存在する、または作成されます

source: The field delimiter character (typically 'tab' if not using the default ',')
fr: Le caractère délimiteur de champ (généralement 'tab' si vous n'utilisez pas la valeur par défaut ',')
it: Il carattere delimitante i campi (tipicamente 'tab' se non si usa il default ',')
ja: フィールド区切り文字（デフォルトの「,」ではない場合、「tab」を使うことが多い）

source: Parse or write the CSV file using the specified text encoding (the default is UTF-8)
fr: Analyser ou écrire le fichier CSV en utilisant le codage de texte spécifié (la valeur par défaut est UTF-8)
it: Parsifica o scrivi il file CSV usando la codifica di testo specificata (il default è UTF-8)
ja: CSVファイルは指定されたテキストエンコーディングを使用します（デフォルトはUTF-8）

source: There's one additional option for ``fromcsv``:
fr: Il y a une option supplémentaire pour `` fromcsv``:
it: C'è un'opzione aggiuntiva per ``fromcsv``:
ja: ``fromcsv``とは以下のオプションも使用出来ます：

source: Automatically add new enum values encountered
fr: Ajouter automatiquement les nouvelles valeurs enum rencontrées
it: Aggiungi automaticamente i nuovi valori enum trovati
ja: まだデータベースに入っていない列挙値を自動的に追加します

source: There's also one additional option for ``tocsv``:
fr: Il y a aussi une option supplémentaire pour `` tocsv``:
it: C'è un'opzione aggiuntiva per ``tocsv``:
ja: ``tocsv``とは以下のオプションも使用出来ます：

source: "crlf" to use Windows-style carriage return + newline, default is UNIX/Mac-style (newline only)
fr: "crlf" pour utiliser un retour à la ligne de style Windows + nouvelle ligne, la valeur par défaut étant UNIX / Mac (nouvelle ligne uniquement)
it: "crlf" per usare return + acapo alla Windows: il default è lo stile UNIX/Mac (solo newline)
ja: 「crlf」に設定すればウィンドウズの改行コード（キャリッジリターンとラインフィード）を使用します。デフォルトはUNIXの改行コード（ラインフィードのみ）。

source: For more information about the PortaBase XML format and tools for doing useful things with it, see the PortaBase homepage (http://portabase.org).
fr: Pour plus d'informations sur le format XML PortaBase et sur les outils permettant de réaliser des tâches utiles, consultez la page d'accueil de PortaBase (http://portabase.org).
it: Per maggiori informazioni sul formato XML in PortaBase e gli strumenti per farci qualcosa di utile, visita la homepage di PortaBase (http://portabase.org).
ja: PortaBaseのXMLフォーマットと、これを使った便利な使い方の詳細は、PortaBaseのホームページ(http://portabase.org)をご覧ください。

source: :samp:`portabase {file}`
cs: :samp:`portabase {soubor}`

source: :samp:`portabase fromxml {xmlfile pobfile}`
cs: :samp:`portabase fromxml {soubor_xml soubor_pob}`

source: :samp:`portabase fromcsv {csvfile pobfile}`
cs: :samp:`portabase fromcsv {soubor_csv soubor_pob}`

source: :samp:`portabase frommobiledb {mdbfile pobfile}`
cs: :samp:`portabase frommobiledb {soubor_mdb soubor_pob}`

source: :samp:`portabase toxml {pobfile xmlfile}`
cs: :samp:`portabase toxml {soubor_pob soubor_xml}`

source: :samp:`portabase tocsv {pobfile csvfile}`
cs: :samp:`portabase tocsv {soubor_pob soubor_csv}`

source: :samp:`portabase tohtml {pobfile htmlfile}`
zh_tw: :舉例：'portabase tohtml {性能檔案 html 檔案}

source: For more information about the PortaBase XML format and tools for doing useful things with it, see the PortaBase homepage (http://portabase.sourceforge.net).
zh_tw: 有關PortaBase的XML格式與相關的工具(比如轉換至HTML)的詳細資訊，請見PortaBase首頁(http://portabase.sourceforge.net)。
