Repository: jmbowman/portabase
Catalog: resources/help/translations/*/data_viewer.po
Languages: cs, fr, ja, zh_tw

source: Data viewer
cs: Prohlížeč dat
fr: Editeur de données
ja: データ表示画面
zh_tw: 資料檢視器

source: This is the main screen of the application, where you can browse the database's content and launch most of the other dialogs. The contents of this screen are:
cs: Toto je hlavní rozhraní aplikace, odkud můžete procházet obsah databáze a otevírat většinu ostatních dialogů. Rozhraní Prohlížeče dat tvoří:
fr: C'est l'écran principal de l'application où vous pouvez naviguer dans la base de données et d'où vous pouvez accéder à la plupart des boites de dialogue. Cet écran contient :
ja: これはこのアプリケーションのメインの画面で、ここでデータベースの内容をブラウズし、他のダイアログの大半を起動することができます。この画面上には以下があります:
zh_tw: 資料檢視器是本應用程式的主要畫面，在此你可以瀏覽資料庫的內容以及叫出大多數的對話盒。此畫面的內容如下：

source: Row display and navigation
cs: Zobrazení záznamů a navigace
fr: Navigation et affichage des lignes
ja: レコード表示・操作部
zh_tw: 資料列顯示與瀏覽

source: Most of the data viewer screen is occupied by a table showing one view of a set of rows in the database. You can scroll through the entire list of rows passing the current filter; performance stays good because only the data for the rows currently shown in the display is loaded. Clicking on a row normally launches the :ref:`row viewer <row_viewer>` dialog; if you disabled this in the :ref:`preferences dialog <preferences>`, you can stil launch it by pressing enter/return, space, or Control-R (Command-R on the Mac) while a row is selected.
cs: Největší část rozhraní Prohlížeče dat zabírá tabulka s náhledem na záznamy dané databáze. Můžete se posouvat po všech záznamech vyhovujících danému filtru; dobrý výkon aplikace to neovlivní, vždy se načtou jen data právě zobrazených záznamů. Klepnutím na záznam se normálně spustí dialog :ref:`Prohlížeče záznamů <row_viewer>`; pokud jste to však v :ref:`dialogu Nastavení <preferences>` zakázali, můžete jej přesto vyvolat stiskem Enter/Return, Mezerníku či Control-R (na Macu Command-R) na vybraném záznamu.
fr: La plus grande partie de l'écran du visualiseur de données est prise par un tableau qui affiche une vue de la base de données. Vous pouvez faire défiler toutes les lignes sans tenir compte du filtre courant ; les performances restent bonnes car seules les lignes affichées sont effectivement chargées. Cliquer sur une ligne lance le :ref:`visualiseur de ligne <row_viewer>` ; si vous l'avez désactiver dans les :ref:préférences <preferences>`, vous pouvez encore le lancer en appuyant sur les touches ENTREE, ESPACE ou CTRL-droite alors qu'une ligne est sélectionnée.
ja: データ表示画面画面の大部分は一つのビューを使って、データベース内のレコードの一部を表示している表で占められています。使っているフィルターにパスする全部のレコードをスクロール出来る; 要求時ページングのおかげで大きいファイルでも遅くなることはない。通常、レコード上でクリックすると\ :ref:`レコード表示画面 <row_viewer>`\ が起動されます。\ :ref:`設定画面 <preferences>`\ でこのオプションを外した場合でも、レコードが選択された状態でスペース、Enter/Return、あるいはCtrl-Rを押すとその画面は起動されます。
zh_tw: 大部分的資料檢示銀幕都被庫表所佔領只展示資料庫一些資料而已。但是你可以利用滾動軸看到整個篩選的表列；性能表現如以前一樣快速因為只有現有顯示裡行列的資料會加載進去。點擊一行通常會啟動:ref:'列檢視器<row_viewer>' 對話；如果你讓他從:ref:'徧好對話<preference>'失去功能,你仍可按進入/返回，空白鍵，或Control-R(在Mac是Command-R) 在你選擇一個你要的一行後。

source: Clicking on a cell in the data display and holding down for 1/2 second or longer before releasing executes special functions. If you do this on a cell in a Note column, the :ref:`note viewer <note_editor>` is displayed showing the content of that note. When done on a cell in an Image column, the image contained in that cell is shown in the :ref:`image viewer <image_viewer>`. If you do it in any other type of column, the :ref:`row editor <row_editor>` for the row you clicked on is launched.
cs: Klepnutí na buňku záznamu z Prohlížeče dat a podržení stisknutého tlačítka myši alespoň 1/2 sekundy vyvolá zvláštní funkce. Provedete-li tuto akci na buňce ve sloupci typu poznámka, otevře se :ref:`Prohlížeč poznámek <note_editor>` zobrazující konkrétní poznámku. Provedete-li akci na buňce ve sloupci typu obrázek, zobrazíte v :ref:`Prohlížeči obrázků <image_viewer>` obrázek obsažený v dané buňce. Provedete-li akci na buňce ve sloupci jiného typu, otevřete :ref:`Editor záznamů <row_editor>` s možností editace daného záznamu.
fr: Cliquer sur une cellule et maintenir enfoncé le bouton de la souris pendant au moins une demi seconde avant de le relâcher, déclenche des fonctions spéciales. Si vous effectuez cette action sur une cellule dans une colonne de type Note alors le :ref:`visualiseur de notes <note_editor>` s'affiche avec le contenu de la note sélectionnée. Sur une cellule d'une colonne de type Image, c'est le :ref:`visualiseur d'images <image_viewer>` qui s'affiche avec l'image correspondante. Pour les autres types de colonne, c'est :ref:`l'éditeur de ligne <row_editor>` qui s'affiche.
ja: データ表示部のセルをクリックし、そのまま0.5秒かそれ以上してから離すと、特別な機能が実行されます。ノートフィールドのセル上でこれを行った場合、\ :ref:`記述画面(表示) <note_editor>`\ でノートの内容が表示されます。イメージフィールドのセル上で行ったときは、そのセルに含まれている画像が\ :ref:`画像表示画面 <image_viewer>`\ で表示されます。他のタイプのフィールド上でこれを行った場合、クリックしたレコードを対象として\ :ref:`レコード編集画面 <row_editor>`\ が起動されます。
zh_tw: 在某個格子上按住不放超過1/2秒時可以執行特殊的功能。如果這個格子位於多行文字項欄位，則會叫出\ :ref:`多行文字項檢視器 <note_editor>`\ 來顯示此多行文字項的內容。如果是其他種型別的欄位，則會叫出\ :ref:`列編輯器 <row_editor>`\ 來處理該格子所在的那一列。

source: If you selected in the :ref:`preferences dialog <preferences>` to use a paginated display, there is an additional row of controls at the bottom of the screen. The spin box at the bottom left specifies the maximum number of rows to display at once for the current view; you can edit this to be any positive integer (setting it low enough eliminates the scrollbar on the right of the display table, giving a little more horizontal space; note that Maemo Fremantle has no such scrollbar). To the right of this "rows per page" box are the page navigation buttons. Click on one of the numbered buttons to go to that page of rows; the button for the current page is shown pressed. Click on the arrow buttons at the ends to show the page buttons for the next or previous five pages.
cs: Pokud jste si v :ref:`dialogu Nastavení <preferences>` vybrali používání stránek v Prohlížeči dat, v dolní části obrazovky naleznete další ovládací prvky. Ovládací prvek v levé dolní části rozhraní udává maximální počet záznamů zobrazených najednou u stávajícího náhledu; počet záznamů lze změnit na libovolné celé kladné číslo (dostatečně nízká hodnota umožní skrýt vertikální posuvník zobrazovaný vpravo od tabulky se záznamy, což zvětší horizontální zobrazovací prostor; na Maemo Fremantle tento posuvník nenajdete). Vpravo od ovládacího prvku pro zadání výchozího počtu záznamů na stránce jsou tlačítka sloužící k navigaci na stránkách. Klepnutím na číslované tlačítko přejdete na odpovídající stránku se záznamy; tlačítko stávající stránky je přitom zobrazeno jako stisknuté. Klepnutím na tlačítko se šipkou zobrazíte tlačítka předešlé nebo následující pětice stránek.
fr: Si dans les :ref:`préférences <preferences>` vous avez choisi d'utiliser un affichage paginé alors une ligne supplémentaire de contrôles apparaît en bas de l'écran. La zone de saisie en bas à gauche indique le nombre maximum de lignes simultanées à afficher dans la vue courante ; vous pouvez modifier cette valeur par n'importe quel entier positif (en la définissant suffisamment basse, la barre de défilement sur la droite de l'affichage disparaît, donnant un peu plus d'espace ; notez que Maemo Fremantle ne dispose pas d'une telle barre de défilement). A la droite de cette boite "lignes par page", il y a les boutons de navigation paginée. Cliquez sur l'un des boutons numérotés pour aller à la page correspondante ; le bouton de la page courante apparaîtra enfoncée. Cliquez sur les flèches pour afficher les boutons de déplacement vers les 5 suivantes/précédentes pages.
ja: :ref:`設定画面 <preferences>`\ で"データ表示にページを使う"を選択した場合、画面の下部にそのためのコントロールがあります。画面左下のスピンボックスには現在のビューで1度に表示するレコード数を示しています; この値は好きな正数に変更することができます（表の表示部の右側にスクロールバーが表示されないような小さい値に設定すると、ちょっとだけ横方向の空間が広がります）。"ページごとのレコード数"ボックスの右側には、ページナビゲーション用のボタンがあります。この数字が振られたボタンのいずれかをクリックすることで、そのレコードページに移動できます; 現在のページは押された状態で表示されています。前の5ページ、または次の5ページのボタンを表示させるには、端にある矢印ボタンをクリックします。
zh_tw: 如果您在偏好對話選擇用分頁顯示:ref:'偏好對話<preference>'，那麼在銀幕最底會增加一行控制列。在旋轉方塊左底邊有說明最多幾行可從展示在在當前檢視窗內；你可以編輯改寫任何一個正整數(設置尺寸小到足以看不在右側的滾動軸，給多一點平行空間；請注意Maemo 沒有滾軸). 在"每頁行數"格子的右邊是頁面導航按鈕。點擊在有數字的按鈕能引導休到那頁面的行列；本頁的按鈕會展現已被按下。點擊在後面有箭頭的按鈕會展示前一頁或下一頁的頁面按鈕。

source: Column labels
cs: Popisky sloupců
fr: Libellé de colonne
ja: フィールドラベル
zh_tw: 欄位標籤

source: The row of column labels has several features in addition to informing you of the column names. To change the widths of the columns in the current view, click on the border between two column labels (or the right edge of the last column) and drag it to the desired location. Clicking on a column label sorts all the rows passing the current filter by the content of that column in ascending order; clicking it again sorts in descending order. If you press a column label and hold it for 1/2 second or more before releasing, the :ref:`column statistics dialog <column_statistics>` is shown.
cs: Záhlaví s popisky sloupců neslouží jen ke zjištění jmén sloupců. Změnu šířky sloupce v daném náhledu docílíte klepnutím na rozhraní záhlaví dvou sloupců (nebo na pravý okraj záhlaví s popiskem posledního sloupce) a přetažením okraje sloupce na požadovanou pozici. Klepnutím na záhlaví s popiskem seřadíte všechny záznamy daného sloupce vyhovující aktuálnímu filtru dle obsahu vzestupně; dalším klepnutím sestupně. Podržíte-li stisknuté záhlaví sloupce alespoň 1/2 sekundy, vyvoláte :ref:`dialog statistiky sloupce <column_statistics>` s údaji pro vybraný sloupec a aktuální filtr.
fr: La ligne des libellés de colonne, en plus de fournir le nom des colonnes, dispose de fonctionnalités additionnelles. Pour changer la largeur des colonnes de la vue courante, cliquez sur la bordure entre deux étiquettes de colonne (ou le bord droit de la dernière colonne) et déplacez la jusqu'à la position souhaitée. Cliquer sur le libellé d'une colonne tri toutes les lignes du filtre courant dans l'ordre croissant de cette colonne ; cliquer une fois encore tri dans l'ordre décroissant. Si vous appuyer sur un libellé de colonne pendant 1/2 seconde au moins avant de relâcher la pression, la :ref:`boite de dialogue des statistiques de colonnes <column_statistics>` s'affiche.
ja: フィールドラベル行にはフィールド名関連の情報を提供するいくつかの追加機能があります。現在のビューでフィールド表示幅を変更するには、二つのフィールドラベル間の境界（あるいは、最後のカラムであれば右端）をクリックし、望みの位置までドラッグします。フィールドラベルをクリックするとそのフィールドの内容の昇順でソートされます; 再度そこをクリックすると降順でソートされます。フィールドをクリックし0.5秒かそれ以上そのままにしてから放すと、\ :ref:`フィールドマリー情報画面 <column_statistics>`\ が表示されます。
zh_tw: 在行裡的欄位標籤有許多特色除了告知你每一欄的名稱外。要改變當前檢視窗的欄位寬度，點擊兩欄位標籤中的邊界(或者最後一橍右邊側) 然後拉到你想要的地方即可。點擊欄位標籤可以將在此欄內已篩選過的行列按照上升行列排序；再點擊一次則按下降行列排序。假如你按上一欄的標籤久一點大亼約二分之一秒或更長一點才放開，就可看到欄位統計對話:ref:'欄位統計對話<column_statistics>'.

source: File menu
cs: Menu "Soubor"
fr: Menu fichier
ja: ファイルメニュー
zh_tw: 檔案選單

source: The "File" menu (the main menu on Maemo) contains options that apply to the database file as a whole. These are:
cs: Menu "Soubor" (hlavní menu na přístrojích s Maemo) obsahuje volby, které se použijí na databázový soubor jako na celek. Jde o:
fr: Le menu "Fichier" (menu principal sur Maemo) contient des options qui s'appliquent à l'ensemble de la base de données. Il y a :
ja: "ファイル"メニュー（Maemo版では唯一のメニュー）にはデータベース全体に適用されるオプションが含まれています。以下があります:
zh_tw: "檔案"選項單(Maemo 的主要選項單)內含有選項可整體應用到資料庫檔案。這些是：

source: **Save**
cs: **Uložit**
fr: **Enregistrer**
ja: **保存**
zh_tw: **儲存**

source: Save any changes that have been made since the file was opened or last saved. If you exit PortaBase without saving the most recent changes, those changes will be lost (a dialog will warn you if this is about to happen). This option is disabled if no changes have been made since the current database was opened or last saved. (Not shown in Maemo, use the toolbar button instead.)
cs: Uloží jakékoli změny provedené v souboru od jeho otevření nebo posledního uložení. Ukončíte-li aplikaci PortaBase bez uložení posledních změn, tyto změny budou ztraceny (předtím se zobrazí dialog s upozorněním). Tato volba není aktivní pokud v databázi od jejího poslední otevření či uložení nebyly prováděny žádné změny. (Chybí na Maemo, použijte tlačítko na liště.)
fr: Enregistre tous les changements qui ont été effectué depuis que le fichier a été ouvert ou depuis la dernière sauvegarde. Si vous quittez PortaBase sans enregistrer les modifications, elles seront perdues (une boite de dialogue vous avertira). Cette option est désactivée tant qu'il n'y a aucune modification (Sur Maemo, utilisez la barre d'outils plutôt).
ja: ファイルが開かれてから、あるいは最後に保存されてから行われた全ての変更を保存します。最後に行った変更を保存せずにPortaBaseを終了すると、それらの変更は失われてしまいます（このようなことが起ころうとすると、ダイアログが現れて警告が表示されます）。このオプションは現在のデータベースが開かれてから、あるいは最後に保存されてからまったく変更が行われていない時には選択できないようになっています。（Maemo版では表示されません; ツールバーの保存ボタンを使います）
zh_tw: 保存從上回打開或上次保存後的任何被糾正過的檔案。如果你登出PortaBase忘記保存最近糾正過的內容，這些將會遺失(一個對話錄將會警告你如果此事將發生). 這個選項將會被取消，如果沒有任何改變自從上次打開此資料庫或保存後。(沒有在Maemo 系統內顯示，需要用工具欄內的按鈕。)

source: **Change Password**
cs: **Změnit heslo**
fr: **Modifier le mot de passe**
ja: **パスワード変更**
zh_tw: **更改密碼**

source: Launch a dialog which allows you to change the data file's password (only shown for :ref:`encrypted files <encryption>`).
cs: Spustí dialog umožňující uživateli změnit heslo datového souboru (zobrazí se jen u :ref:`šifrovaných souborů <encryption>`).
fr: Ouvre une boite de dialogue qui vous permet de changer le mot de passe du fichier (visible seulement pour les :ref:`fichiers chiffrés <encryption>`).
ja: データファイルのパスワードを変更するためのダイアログを起動します（\ :ref:`暗号化された <encryption>`\ ファイルでのみ表示されます）。
zh_tw: 啟動對話錄來改變你的資料檔案(只有顯示在:ref:'檔案加密<encryption>').

source: **Import**
cs: **Importovat...**
ja: **インポート**
zh_tw: **匯入**

source: :ref:`Import <import>` rows from a CSV file.
cs: Umožní provést :ref:`import <import>` záznamů ze souboru CSV.
fr: :ref:`Importe <import>` les lignes à partir d'un fichier CSV.
ja: CSVファイルからレコードの\ :ref:`インポート <import>`\ を行うことができます。
zh_tw: 你可以由一個CSV格式的檔案\ :ref:`匯入 <import>`\ 所有資料列。

source: **Export**
cs: **Exportovat...**
ja: **エクスポート**
zh_tw: **匯出**

source: :ref:`Export <export>` the current database content to a CSV, HTML, or XML file.
cs: :ref:`Exportuje <export>` stávající obsah databáze do souboru CSV, HTML či XML.
fr: :ref:`Exporte <export>` le contenu de la base de données courante dans un fichier CSV, HTML ou XML.
ja: 現在のデータベースの内容をCSV、HTML、またはXMLファイルに\ :ref:`エクスポート <export>`\ することができます。
zh_tw: :ref:' 輸出<export>' 用以外傳最近的資料庫內容到一個CSV,HTML, 或XML 型的檔案。

source: **Delete Rows In Filter**
cs: **Smazat záznamy vyhovující aktuálnímu filtru**
fr: **Supprimer les lignes d'un filtre**
ja: **フィルターに含まれるレコードを削除**
zh_tw: **刪除篩選中的所有資料列**

source: Deletes all rows which are included by the filter currently in use.
cs: Smaže všechny záznamy, které vyhovují právě používanému filtru.
fr: Supprime toutes les lignes incluses dans le filtre courant.
ja: 現在使用しているフィルターに含まれるレコードを全て削除します。
zh_tw: 刪除套用目前篩選後得到的所有資料列。

source: **Edit Columns**
cs: **Editor sloupců**
fr: **Modifier les colonnes**
ja: **フォーマット編集**
zh_tw: **編輯欄位**

source: Launch the :ref:`columns editor <columns_editor>`.
cs: Otevře :ref:`Editor sloupců <columns_editor>`.
fr: Ouvre :ref:`l'éditeur de colonnes <columns_editor>`.
ja: :ref:`フォーマット編集画面 <columns_editor>`\ を起動します。
zh_tw: 叫出\ :ref:`欄位編輯器 <columns_editor>`\ 。

source: **Edit Enums**
cs: **Editor seznamů**
fr: **Modifier les énumérations**
ja: **列挙管理**
zh_tw: **編輯集合**

source: Launch the :ref:`enum manager <enum_manager>`.
cs: Otevře :ref:`Správce seznamů <enum_manager>`.
fr: Ouvre le :ref:`gestionnaire d'énumération <enum_manager>`.
ja: :ref:`列挙管理画面 <enum_manager>`\ を起動します。
zh_tw: 叫出\ :ref:`集合管理員 <enum_manager>`\ 。

source: **Slideshow**
cs: **Automatické přepínání obrázků**
fr: **Diaporama**
ja: **スライドショー**
zh_tw: **幻燈片**

source: Launch a dialog from which you can start a timed slideshow of images from an Image column in the current view. Only images in rows passing the current filter are shown, and the sequence is the current sorting.
cs: Otevře dialog, ze kterého lze spustit časovanou prezentaci z obrázků zahrnutých ve sloupci typu obrázek ve stávajícím náhledu. Zobrazeny budou jen obrázky záznamů vyhovujících aktuálnímu filtru ve stávajícím pořadí.
fr: Ouvre une boite de dialogue qui vous permet de démarré u diaporama temporisé à partir d'une colonne de type Image dans la vue courante. Seules les images correspondant au filtre courant sont affichées et l'ordre est celui du tri en cours.
ja: 現在のビューに含まれている画像フィールドの画像を時間駆動でスライドショーするための画面を起動します。現在のフィルターに含まれているレコードの画像だけが使用され、順番は現在のソーティングになります。
zh_tw: 啟動一個對話框，從中你可以開始定時幻燈片顯示的圖像從圖像列在當前視圖。只有通過圖像的行顯示當前的篩選和序列是當前的排序。

source: **Properties**
cs: **Vlastnosti**
fr: **Propriétés**
ja: **プロパティ**
zh_tw: **屬性**

source: Launch a dialog which displays basic statistics about the current file (such as its size, row count, column count, etc.). The :ref:`column statistics dialog <column_statistics>` can also be launched from this dialog.
cs: Otevře dialog zobrazující základní statistické údaje o stávajícím souboru (např. jeho velikost, počet záznamů, počet sloupců, aj.). Z tohoto dialogu lze otevřít také :ref:`dialog statistiky sloupce <column_statistics>`.
fr: Ouvre une boite de dialogue qui affiche quelques statistiques sur le fichier courant (telles que la taille, le nombre de ligne, le nombre de colonne, ...) La boite de dialogue des :ref:`statistiques de colonne <column_statistics>` peut aussi être ouverte depuis cette boite de dialogue.
ja: 現在のファイルについての基本的な統計情報（サイズ、レコード数、フィールド数など）を表示する画面を起動します。その画面から\ :ref:`フィールドマリー情報画面 <column_statistics>`\ を起動する事も出来ます。
zh_tw: 啟動對話器來展示當前檔案的統計數字(比如它的尺寸，多少行，多少欄，等等。). 這欄位統計數字對話也可在此對話中啟動。:ref:'欄位統計對話<column_statistics>.

source: **Print Preview**
cs: **Tiskový náhled**
fr: **Aperçu avant impression**
ja: **印刷プレビュー**
zh_tw: **打印預覽**

source: Launch the print preview dialog in order to see what the output of printing the current data selection would look like. You can also set from here certain properties of the output, such as paper size and zoom factor. (Not shown in Maemo, which has no printing support.)
cs: Spustí dialog tiskového náhledu s možností prohlédnout si, jak by vypadal tiskový výstup vybraných dat. Na tomto místě lze rovněž nastavit některé vlastnosti výstupu, např. velikost papíru a měřítko. (Nedostupné na Maemo, které postrádá podporu tisku.)
fr: Ouvre l'aperçu avant impression afin de voir à quoi ressemblerait l'impression des données actuellement sélectionnées. Vous pouvez définir certaines propriétés de l'impression telles que la taille du papier et le facteur de zoom (Non visible dans Maemo qui ne dispose pas du support de l'impression).
ja: 使っているビューなどで印刷したらどうなりますかを示す画面を表示します。用紙サイズとズーム率などの設定もこの画面で選択できます。（印刷機能のないMaemoでは表示されません）
zh_tw: 打印預覽對話框啟動，以便看看輸出打印出當前的數據選擇會是什麼樣子。您也可以從這裡設置某些屬性的輸出，如紙張大小和縮放因子。（不顯示在Maemo操作，又沒有打印支持。）

source: **Print**
cs: **Tisk**
fr: **Imprimer**
ja: **印刷**
zh_tw: **打印**

source: Launch the print dialog in order to print the data in the current view and filter in the current sorting order. Note that you may wish to modify some settings with the print preview dialog first. (Not shown in Maemo, which has no printing support.)
cs: Spustí tiskový dialog pro tisk dat stávajícího náhledu, filtru a pořadí. Berte na vědomí, že případné změny v nastavení tisku je nutné provést předem přes dialog tiskového náhledu. (Nedostupné na Maemo, které postrádá podporu tisku.)
fr: Ouvre la boite de dialogue pour imprimer les données de la vue et du filtre courants en respectant l'ordre de tri en cours. Notez que vous pouvez préalablement modifier certaines propriétés via l'aperçu avant impression (Non visible dans Maemo qui ne dispose pas du support de l'impression).
ja: 使っているビュー、フィルター、とソーティングを適用したデータを印刷します。先に印刷プレビューの画面で設定を確認した方がいいかもしれません。（印刷機能のないMaemoでは表示されません）
zh_tw: 啟動打印對話框，以打印當前視圖中的數據和過濾器在目前的排序順序。請注意，您可能希望修改某些設置與打印預覽對話框的第一。（不顯示在Maemo操作，又沒有打印支持。）

source: **Preferences**
cs: **Nastavení**
fr: **Préférences**
ja: **設定**
zh_tw: **偏好設定**

source: Launch the :ref:`preferences dialog <preferences>`.
cs: Otevře :ref:`dialog "Nastavení "<preferences>`.
fr: Ouvre la boite de dialogue des :ref:`préférences <preferences>`.
ja: :ref:`設定画面 <preferences>`\ を起動します。
zh_tw: 叫出\ :ref:`偏好設定對話盒 <preferences>`\ 。

source: **Close**
cs: **Zavřít**
fr: **Fermer**
ja: **閉じる**
zh_tw: **關閉**

source: Close the current file; if there are unsaved changes, you will be asked if you want to save them. (Not shown in Maemo, use the close button at the top right of the screen instead; you may need to exit fullscreen mode first.)
cs: Zavře stávající soubor; vyskytují-li se v souboru neuložené změny, bude uživatel dotázán, přeje-li si je uložit. (Chybí na Maemo, použijte tlačítko v pravém horním rohu obrazovky; nejdříve je třeba opustit celoobrazovkové zobrazení.)
fr: Ferme le fichier courant ; s'il y a des modifications non enregistrées une question vous sera posée vous demandant si vous désirez les enregistrer (Non visible dans Maemo, utilisez le bouton de fermeture en haut à droite de l'écran à la place ; si nécessaire, sortir du mode plein écran au préalable)
ja: 現在のファイルを閉じます; 保存されていない変更がある場合は、これを保存するかと聞かれます。（Maemo版では表示されません、上右のボタンを使います; フルスクリーン表示の場合、まず通常表示に戻ります）
zh_tw: 關閉當前的檔案；如果有尚有巳編正但尚未保存者，你會被問是否要保存它們。(但不在Maemo 顯示，而必須用在銀幕最右上方的關閉按鈕；有可能要從全銀幕先退出。)

source: Row menu (not on Maemo)
cs: Menu Záznam (chybí na Maemo)
fr: Menu Ligne (non présent dans Maemo)
ja: レコードメニュー（Maemo版意外）
zh_tw: 資料列選單(沒有 Maemo操作)

source: The "Row" menu contains actions that apply to individual rows of data. These are:
cs: Menu "Záznam" obsahuje akce, které se vztahují k jednotlivým datovým záznamům. Jde o:
fr: Le menu "Ligne" contient les actions qui s'appliquent à des lignes individuelles. Il y a :
ja: "レコード"メニューにはここのレコードに適用されるアクションが含まれています。以下があります:
zh_tw: 資料列選單包含下列的選項：

source: **Add**
cs: **Přidat**
fr: **Ajouter**
ja: **作成**
zh_tw: **新增**

source: Add a new row of data (by launching the :ref:`row editor <row_editor>`).
cs: Přidá nový záznam (otevře :ref:`Editor záznamů <row_editor>`).
fr: Ajoute une nouvelle ligne (en ouvrant :ref:`l'éditeur de ligne <row_editor>`).
ja: 新しいレコードを作成します（\ :ref:`レコード編集画面 <row_editor>`\ が起動されます）。
zh_tw: 新增一資料列(透過\ :ref:`列編輯器 <row_editor>`\ )。

source: **Edit**
cs: **Editovat**
fr: **Modifier**
ja: **編集**
zh_tw: **編輯**

source: Edit the currently selected row of data (again using the row editor).
cs: Umožní editovat vybraný stávající záznam (opět přes Editor záznamů).
fr: Modifier la ligne actuellement sélectionnée (encore une fois en utilisant l'éditeur de ligne).
ja: 選択されているデータレコードを編集します（これもレコード編集画面を使用します）。
zh_tw: 編輯目前選定之資料列(同樣是透過列編輯器)。

source: **Delete**
cs: **Smazat**
fr: **Supprimer**
ja: **削除**
zh_tw: **刪除**

source: Delete the currently selected row of data.
cs: Smaže vybraný záznam.
fr: Supprime la ligne actuellement sélectionnée.
ja: 選択されているデータレコードを削除します。
zh_tw: 刪除目前選定之資料列。

source: **Copy**
cs: **Kopírovat...**
fr: **Copier**
ja: **コピー**
zh_tw: **複製**

source: Add a new row of data, but the row editor is pre-filled with the data in the currently selected row instead of the default values.
cs: Přidá nový záznam, který bude obsahovat (v Editoru záznamů) předvyplněné údaje vybraného záznamu namísto výchozích hodnot.
fr: Ajoute une nouvelle ligne mais l'éditeur de ligne est pré-rempli avec les données de la ligne actuellement sélectionnée, au lieu des valeurs par défaut.
ja: 新しいデータレコードを作成しますが、レコード編集画面はあらかじめ、デフォルト値の代わりに現在選択されているレコードのデータが入力されています。
zh_tw: 也是新增一資料列，但列編輯器會自動將目前選定之資料列的內容填入對應的欄位中。

source: **Show**
cs: **Zobrazit**
fr: **Afficher**
ja: **表示**
zh_tw: **展示**

source: Show the currently selected row in the :ref:`row viewer <row_viewer>`.
cs: Zobrazí právě vybraný záznam v :ref:`Prohlížeči záznamů <row_viewer>`.
fr: Affiche la ligne actuellement sélectionnée dans :ref:`le visualiseur de ligne <row_viewer>`.
ja: 現在選択されているレコードを\ :ref:`レコード表示画面 <row_viewer>`\ で表示します。
zh_tw: 在列位檢視器裡顯示當前選取的行列:ref:'列位檢視器<row_viewer>'.
