Repository: jmbowman/portabase
Catalog: resources/help/translations/*/data_viewer.po
Languages: cs, fr, ja, zh_tw

source: In order to conserve screen space, Maemo does not include this menu; equivalent functionality is available through the toolbar and :ref:`row viewer <row_viewer>` buttons.
cs: Kvůli úspoře místa na obrazovce na Maemo toto menu chybí; stejnou funkcionalitu však plní tlačítka na liště a v :ref:`Prohlížeči záznamů <row_viewer>`.
fr: Afin de préserver de l'espace sur l'écran, Maemo ne dispose pas de ce menu ; une fonctionnalité équivalente est disponible via la barre d'outils et les boutons du :ref:`visualiseur de ligne <row_viewer>` buttons.
ja: 小さい画面をうまく使うために、Maemo版はこのメニューを表示しません。同等な機能はツールバーと\ :ref:`レコード表示画面 <row_viewer>`\ のボタンを通じて使えます。
zh_tw: 為了保留銀幕的空間，Maemo 不含此選取項目表；但當你在工具欄內啟動列位檢視器時你可以找到同等功能. :ref:'列位檢視器<row_viewer>'按鈕。

source: View menu (not on Maemo)
cs: Menu "Náhled" (chybí na Maemo)
fr: Menu Vue (Non présent sur Maemo)
ja: ビューメニュー（Maemo版意外）
zh_tw: 檢視選單(沒有 Maemo操作)

source: The "View" menu allows you to select and manage views. The top section of this menu has three options:
cs: Menu "Náhled" umožňuje výběr a správu náhledů. Horní sekce tohoto menu má tři volby:
fr: Le menu "Vue" vous permet de sélectionner et de gérer les vues. La partie supérieure de ce menu dispose de trois options :
ja: "ビュー"メニューではビューの選択と管理ができます。このメニューの先頭部には3つのオプションがあります:
zh_tw: "景觀"選單使你可以選擇與管理景觀。此選單的最上層有三個選項：

source: Add a new view to the database file. Choosing this option launches the :ref:`view editor <view_editor>` with no name specified and none of the columns checked.
cs: Umožní přidat nový náhled do souboru databáze. Výběr této volby otevře :ref:`Editor náhledů <view_editor>` bez jména nového náhledu a bez vybraného kteréhokoli sloupce.
fr: Ajouter. Choisir cette option ouvre :ref:`l'éditeur de vue <view_editor>` sans aucun nom inscrit et aucune colonne cochée.
ja: データベースファイルに新しいビューを追加します。このオプションを選択すると、名前は未指定、全てのフィールドが未チェックの状態で、\ :ref:`ビュー編集画面 <view_editor>`\ が起動されます。
zh_tw: 加入一個新的數據庫視圖到數據庫檔案裡。可以選用這選項來啟動檢視編輯器:ref:'檢視編輯<view_editor>' 沒有特定的名字也沒有特別指定那些欄位。

source: Edit the currently displayed view. Choosing this option launches the view editor with the current view's name and column sequence. The "All Columns" view cannot be edited.
cs: Umožní editaci právě zobrazeného náhledu. Výběr této volby otevře Editor náhledů se zobrazením jména aktuálního náhledu a jeho uspořádáním sloupců. Náhled "Všechny sloupce" nelze editovat.
fr: Modifier. Choisir cette option ouvre l'éditeur de vue avec le nom de la vue courante et l'ensemble de ses colonnes. La vue "Toutes les colonnes" n'est pas modifiable.
ja: 現在表示されているビューを編集します。このオプションを選択すると、現在のビューの名前とフィールド状態でビュー編集画面が起動されます。
zh_tw: 編輯目前顯示的景觀。此選項會叫出景觀編輯器，其內容為目前景觀的名稱與欄位順序。你無法編輯"全欄位"景觀。

source: Delete the currently displayed view and switch to the "All Columns" view. The "All Columns" view cannot be deleted.
cs: Smaže vybraný náhled a přepne Prohlížeč dat do náhledu "Všechny sloupce". Náhled "Všechny sloupce" nelze smazat.
fr: Supprimer. Supprime la vue courante et bascule sur la vue "Toutes les colonnes". La vue "Toutes les colonnes" ne peut pas être supprimée.
ja: 現在表示されている削除を削除し、"全てのフィールド"ビューに切り替えます。"全てのフィールド"ビューを削除することはできません。
zh_tw: 刪除目前顯示的景觀並切換到"全欄位"景觀。你無法刪除"全欄位"景觀。

source: Below these items in the menu is a list of all the views defined for the current database, with a check next to the one currently displayed. To switch to a different view, simply select the one you want to see from the menu.
cs: Pod těmito položkami obsahuje menu přehled všech náhledů vytvořených pro stávající databázi, u právě zobrazeného náhledu je zatržítko. Chcete-li přepnout na jiný náhled, jednoduše vyberte požadovaný náhled z menu.
fr: La partie inférieure du menu contient la liste des vues définies pour la base de données courante, avec une coche en face de la vue actuellement affichée. Pour basculer sur une autre vue, sélectionnez simplement dans la liste celle que vous souhaiter afficher.
ja: メニュー内のこれらの項目より下は現在のデータベースに定義されている全てのビューのリストで、現在表示されているものの隣にチェックがついています。別のビューに切り替えるには、表示したいものをこのメニューから選択します。
zh_tw: 在選單下方的是目前資料庫中已定義景觀的清單，目前景觀的旁邊會有一個選取記號。要切換到另一個景觀的話，直接在選單上選取所要的景觀即可。

source: In order to conserve screen space, Maemo does not include this menu; equivalent functionality is available in the :ref:`views dialog <vsf_dialogs>` launched from the toolbar.
cs: Kvůli úspoře místa na obrazovce na Maemo toto menu chybí; stejnou funkcionalitu však plní :ref:`dialog náhledů <vsf_dialogs>` spuštěný z tlačítkové lišty.
fr: Afin de préserver de l'espace sur l'écran, Maemo n'inclus pas ce menu ; une fonctionnalité équivalente est disponible dans :ref:`la boite de dialogue des vues <vsf_dialogs>` ouverte depuis la barre d'outils.
ja: 小さい画面をうまく使うために、Maemo版はこのメニューを表示しません。同等な機能はツールバーから起動させる\ :ref:`ビュー管理画面 <vsf_dialogs>`\ を通じて使えます。
zh_tw: 為了保留銀幕的空間，Maemo 不含此選取項目表；但當你在工具欄內啟動檢視對話時你可以找到同等功能. :ref:'檢視對話<vsf_dialogs>'

source: Sort menu (not on Maemo)
cs: Menu Pořadí (chybí na Maemo)
fr: Menu Tri (non présent sur Maemo)
ja: ソートメニュー（Maemo版意外）
zh_tw: 排序選單(沒有 Maemo操作)

source: The "Sort" menu allows you to select and manage sorting configurations. The top section of this menu has three options:
cs: Menu "Pořadí" umožňuje výběr a správu konfigurací řazení položek. Horní sekce tohoto menu obsahuje tři volby:
fr: Le menu "Tri" vous permet de sélectionner et gérer les configurations de tri. La section supérieure de ce menu à trois options :
ja: "ソート"メニューでは、ソーティング（表示順）の設定の選択と管理ができます。このメニューの先頭部には3つのオプションがあります:
zh_tw: "排序"選單使你可以選擇與管理排序方式的設定。此選單的最上層有三個選項：

source: Add a new sorting to the database file. Choosing this option launches the :ref:`sorting editor <sorting_editor>` with no name specified and none of the columns checked.
cs: Umožní přidat do souboru databáze nové pořadí záznamů. Výběr této volby spustí :ref:`Editor pořadí <sorting_editor>` s novým pořadím beze jména a bez označených datových sloupců.
fr: Ajouter un nouveau tri à la base de données. Choisir cette option ouvre :ref:`l'éditeur de tri <sorting_editor>` sans aucun nom spécifié ni de colonne cochée.
ja: データベースファイルに新しいソーティングを作成します。このオプションを選択すると、名前が未指定で、全てのフィールドがチェックされていない状態で\ :ref:`ソーティング編集画面 <sorting_editor>`\ が起動されます。
zh_tw: 新增一個排序方式。使用此選項會叫出\ :ref:`排序方式編輯器 <sorting_editor>`\ ，其中的內容完全未指定。

source: Edit the currently used sorting (only available if a named sorting is in use). Choosing this option launches the sorting editor with the current sorting's name and settings.
cs: Umožní editaci právě použitého pořadí (dostupné jen při použití již pojmenovaného pořadí). Výběr této volby spustí Editor pořadí s otevřením aktuálního pořadí a jeho nastavení.
fr: Modifier le tri actuellement utilisé (disponible seulement si un tri nommé est utilisé). Choisir cette option ouvre l'éditeur de tri avec le nom et la configuration du tri courant.
ja: 現在使用されているソーティングを編集します（命名済みのソーティングがすでに使用されている時のみ選択できます）。このオプションを選択すると、現在のソーティングの名前とフィールド状態でソーティング編集画面が起動されます。
zh_tw: 編輯目前使用的排序方式(必須在使用特定排序方式時才能使用本選項)。使用此選項會叫出排序方式編輯器，內容則為目前排序方式的名稱與設定。

source: Delete the currently used sorting (only available if a named sorting is in use).
cs: Umožní smazat právě použité pořadí (dostupné jen při použití již pojmenovaného pořadí).
fr: Supprimer le tri actuellement utilisé (disponible seulement si un tri nommé est utilisé)
ja: 現在使用されているソーティングを削除します（命名済みのソーティングがすでに使用されている時のみ選択できます）。
zh_tw: 刪除目前使用的排序方式(必須在使用特定排序方式時才能使用本選項)。

source: Below these items in the menu is a list of all the sortings defined for the current database, with a check next to the one currently in use (if any). To change the way the rows are sorted, simply select the sorting configuration you want to use from the menu. If you just want to sort by a single column that is displayed in the current view, it is probably faster to use the "click on a column label to sort" feature instead.
cs: Pod těmito položkami menu nalezneme přehled všech pořadí definovaných pro danou databázi, zatržítko vlevo od jména pořadí ukazuje, je-li některé z nich právě použito. Chcete-li změnit způsob řazení záznamů, jednoduše vyberte požadované pořadí z menu. Chcete-li seřadit záznamy podle jediného datového sloupce zobrazeného v aktuálním náhledu, bude zřejmě rychlejším způsobem klepnutí na záhlaví s popiskem sloupce, podle kterého chcete záznamy seřadit.
fr: Dans le menu, sous ces items, se trouve une liste de tous les tris définis pour la base de données courante, avec une croix en face de celui actuellement utilisé (s'il y en a). Pour changer la façon dont les lignes sont triées, sélectionnez simplement la configuration de tri désirée dans le menu. Si vous voulez seulement trier sur une seule colonne affichée dans la vue courante, il est alors plus rapide d'utiliser la fonctionnalité "cliquer sur l'étiquette de la colonne pour trier".
ja: メニュー内のこれらの項目より下は現在のデータベースに定義されている全てのソーティングのリストで、（ソーティングを使用しているときは）現在使用されているものの隣にチェックがついています。レコードのソート方法を変更するには、使用したいソーティング設定をこのメニューから選択します。もし現在のビューで表示されているフィールドの1つでソートしたいだけであれば、代りに"フィールドラベルのクリックでのソート"機能を使う方が早いでしょう。
zh_tw: 在選單下方的是目前資料庫中已定義排序方式的清單，目前排序方式旁邊會有一個選取記號。要更改資料列排序方式的話，直接由選單中選擇要使用的排序方式即可。如果你只要依據目前景觀中的某一欄位來排序，直接在該欄位標籤上按一下會比較快。

source: In order to conserve screen space, Maemo does not include this menu; equivalent functionality is available in the :ref:`sortings dialog <vsf_dialogs>` launched from the toolbar.
cs: Kvůli úspoře místa na obrazovce na Maemo toto menu chybí; stejnou funkcionalitu však plní :ref:`dialog pořadí <vsf_dialogs>` spuštěný z tlačítkové lišty.
fr: Afin de préserver de l'espace sur l'écran, Maemo n'inclus pas ce menu ; une fonctionnalité équivalente est disponible dans :ref:`la boite de dialogue des tris <vsf_dialogs>` ouverte depuis la barre d'outils.
ja: 小さい画面をうまく使うために、Maemo版はこのメニューを表示しません。同等な機能はツールバーから起動させる\ :ref:`ソーティング管理画面 <vsf_dialogs>`\ を通じて使えます。
zh_tw: 為了保留銀幕的空間，Maemo 不含此選取項目表；但當你在工具欄內啟動排序對話時你可以找到同等功能. :ref:'排序對話<vsf_dialogs>'

source: Filter menu (not on Maemo)
cs: Menu "Filtr" (chybí na Maemo)
fr: Menu Filtre (non présent sur Maemo)
ja: フィルターメニュー（Maemo版意外）
zh_tw: 篩選選單(沒有 Maemo操作)

source: The "Filter" menu contains options that let you choose which rows of data to display. The top section of this menu has four options:
cs: Menu "Filtr" obsahuje volby umožňující vybrat, které záznamy mají být zobrazeny. Horní sekce tohoto menu zahrnuje čtyři volby:
fr: Le menu "Filtre" contient les options qui vous permettent de choisir quelles lignes de données afficher. La section supérieure de ce menu a 4 options :
ja: "フィルター"メニューには、表示対象にするデータレコードを選択するためのオプションがあります。このメニューの先頭部には4つのオプションがあります:
zh_tw: "篩選"選單使你能夠選擇要顯示哪些資料列。此選單的最上層有四個選項：

source: **Quick Filter**
cs: **Vyhledat**
fr: **Filtre rapide**
ja: **簡易フィルター**
zh_tw: **快速**

source: Lets you quickly define and use a temporary one-condition filter. To see all rows again (or use another defined filter), choose the appropriate filter from the lower part of this menu.
cs: Slouží k rychlé definici dočasného filtru obsahujícímu jen jedinou podmínku. Chcete-li pak znovu zobrazit všechny záznamy (nebo použít jiný nadefinovaný filtr), vyberte požadovaný filtr z dolní části tohoto menu.
fr: Vous permet de définir rapidement un filtre mono-condition et de l'utiliser. Pour voir à nouveau toutes les lignes (ou utiliser un autre filtre), choisissez le filtre approprié dans la section inférieure de ce menu.
ja: 一時的な一つの条件だけでのfilterを、簡単に指定できます。全てのレコードを表示しなおす（または別のフィルタを定義して使用する）には、メニューの下部から適当なフィルターを選択してください。
zh_tw: 可以快速定義及使用單一條件的暫時性篩選。要再度顯示所有的資料列(或使用其他的篩選)，在選單的下方選擇適當的篩選即可。

source: Define a new data filter; this launches the :ref:`filter editor <filter_editor>` with no name and no conditions defined.
cs: Umožní nadefinovat nový filtr; bude přitom spuštěn :ref:`Editor filtrů <filter_editor>` beze jména a bez definovaných podmínek.
fr: Définir un nouveau filtre de données; ouvre :ref:`l'éditeur de filtre <filter_editor>` sans nom ni condition définis.
ja: 新しいデータフィルターを定義します; これは、名前が未指定で、何も条件が定義されていない状態で\ :ref:`フィルター編集画面 <filter_editor>`\ を起動します。
zh_tw: 定義一個新的篩選; 它會叫出\ :ref:`篩選編輯器 <filter_editor>`\ ，其中的內容完全空白。

source: Edit the currently selected data filter (again using the filter editor). The "All Rows" filter cannot be edited.
cs: Umožní editaci právě vybraného filtru (opět pomocí :ref:`Editoru filtrů <filter_editor>`). Filtr "Všechny záznamy" nelze editovat.
fr: Modifier le filtre de données actuellement sélectionné (en utilisant à nouveau l'éditeur de filtre). Le filtre "Toutes les lignes" ne peut pas être modifié.
ja: 使用しているデータフィルターを編集します（これもフィルター編集画面を使用します）。"全てのレコード"フィルターは編集できません。
zh_tw: 編輯目前選定之篩選(也是透過\ :ref:`篩選編輯器 <filter_editor>`\ )。你無法編"全資料列"這個篩選。

source: Delete the currently selected data filter. The "All Rows" filter cannot be deleted.
cs: Umožní smazat právě vybraný filtr. Filtr "Všechny záznamy" nelze smazat.
fr: Supprimer le filtre de données actuellement sélectionné. Le filtre "Toutes les lignes" ne peut pas être supprimé.
ja: 使用しているデータフィルターを削除します。"全てのレコード"フィルターは削除できません。
zh_tw: 刪除目前選定之篩選。你無法刪除"全資料列"這個篩選。

source: Below these items in the menu is a list of all the filters defined for the current database, with a check next to the one currently in use (if any). To select a different filter, simply select the one you want to use from the menu.
cs: Pod těmito položkami menu nalezneme přehled všech filtrů definovaných pro danou databázi, zatržítko vlevo od jména filtru ukazuje, je-li některý z nich právě použit. Chcete-li použít jiný filtr, jednoduše jej vyberte z menu.
fr: Sous ces entrées dans le menu apparaît la liste de tous les filtres définis pour la base de données courante, avec une coche à côté du filtre courant (s'il y en a). Pour sélectionner un filtre différent, sélectionnez simplement celui désiré à partir de ce menu.
ja: メニュー内のこれらの項目より下は現在のデータベースに定義されている全てのフィルターのリストで、（フィルターを使用していれば）現在表示されているものの隣にチェックがついています。別のフィルターに切り替えるには、表示したいものをこのメニューから選択します。
zh_tw: 在這些項目下方是本資料庫已有篩選的清單，目前篩選旁會有一個選取記號。要選用其他的篩選，直接由選單中選擇要使用的篩選即可。

source: In order to conserve screen space, Maemo does not include this menu; equivalent functionality is available in the :ref:`filters dialog <vsf_dialogs>` launched from the toolbar.
cs: Kvůli úspoře místa na obrazovce na Maemo toto menu chybí; stejnou funkcionalitu však plní :ref:`dialog filtrů <vsf_dialogs>` spuštěný z tlačítkové lišty.
fr: Afin de préserver de l'espace à l'écran, Maemo ne dispose pas de ce menu ; la fonctionnalité équivalente est disponible dans :ref:`la boite de dialogue des filtres <vsf_dialogs>` accessible par la barre d'outils.
ja: 小さい画面をうまく使うために、Maemo版はこのメニューを表示しません。同等な機能はツールバーから起動させる\ :ref:`フィルター管理画面 <vsf_dialogs>`\ を通じて使えます。
zh_tw: 為了保留銀幕的空間，Maemo 不含此選取項目表；但當你在工具欄內啟動篩選對話時你可以找到同等功能. :ref:'篩選對話<vsf_dialogs>'

source: Toolbar buttons
cs: Tlačítka lišty
fr: Barre d'outils
ja: ツールバーボタン
zh_tw: 工具列按鈕

source: There is a toolbar of buttons that provide quick access to commonly used operations. These are:
cs: K nejčastěji používaným operacím lze přistupovat přes tlačítka umístěná na liště. Jde o:
fr: Il y a une barre d'outils qui permet d'accéder aux opérations les plus utilisées. Il y a :
ja: 共通的に使われる操作に素早くアクセスするためのボタンを配したツールバーがあります。以下がそうです:
zh_tw: 本程式提供一具有四個按鈕的工具列來存取常用的操作。他們是：

source: Same as "Save" in the :ref:`File menu <file_menu>`.
cs: Odpovídá volbě "Uložit" z menu ":ref:`Soubor <file_menu>`".
fr: Pareil que "Enregistrer" dans le :ref:`menu fichier<file_menu>`.
ja: :ref:`ファイルメニュー <file_menu>`\ の"保存"と同じです。
zh_tw: 與\ :ref:`檔案選單 <file_menu>`\ 中的"存檔"功能相同。

source: Same as "Add" in the :ref:`Row menu <row_menu>`.
cs: Odpovídá volbě "Přidat" z menu ":ref:`Záznam <row_menu>`".
fr: Pareil que "Ajouter" dans le :ref:`menu Ligne <row_menu>`.
ja: :ref:`レコードメニュー <row_menu>`\ の"作成"と同じです。
zh_tw: 與\ :ref:`資料列選單 <row_menu>`\ 中的"新增"功能相同。

source: Same as "Edit" in the :ref:`Row menu <row_menu>`. (Not on Maemo)
cs: Odpovídá volbě "Editovat" z menu :ref:`Záznam <row_menu>`. (Chybí na Maemo)
fr: Pareil que "Modifier" dans le :ref:`menu Ligne <row_menu>`. (Non présent dans Maemo)
ja: :ref:`レコードメニュー <row_menu>`\ の"編集"と同じです。（Maemo版以外）
zh_tw: 與在行列項目裡的"編輯"相同(但不在Maemo) :ref:'行列項目<row_menu>'.

source: Same as "Copy" in the :ref:`Row menu <row_menu>`. (Not on Maemo)
cs: Odpovídá volbě "Kopírovat" z menu :ref:`Záznam <row_menu>`. (Chybí na Maemo)
fr: Pareil que "Copier" dans le :ref:`menu Ligne <row_menu>`. (Non présent dans Maemo)
ja: :ref:`レコードメニュー <row_menu>`\ の"コピー"と同じです。（Maemo版以外）
zh_tw: 與在行列項目裡的"複製" 相同(但不在Maemo) :ref:'行列項目<row_menu>'.

source: Same as "Delete" in the :ref:`Row menu <row_menu>`. (Not on Maemo)
cs: Odpovídá volbě "Smazat" z menu :ref:`Záznam <row_menu>`. (Chybí na Maemo)
fr: PAreil que "Supprimer" dans le :ref:`menu Ligne <row_menu>`. (Non présent dans Maemo)
ja: :ref:`レコードメニュー <row_menu>`\ の"削除"と同じです。（Maemo版以外）
zh_tw: 與在行列項目裡的"刪除" 相同(但不在Maemo) :ref:'行列項目<row_menu>'.

source: **Views**
cs: **Náhledy**
fr: **Vues**
ja: **ビュー管理**
zh_tw: **景觀**

source: Launch the :ref:`views dialog <vsf_dialogs>`.
cs: Spustí :ref:`dialog "Náhledy" <vsf_dialogs>`.
fr: Ouvre la :ref:`boite de dialogue des vues <vsf_dialogs>`.
ja: :ref:`ビュー管理が面 <vsf_dialogs>`\ を起動します。
zh_tw: 啟動:ref:'檢視對話器<vsf_dialogs>'.

source: **Sortings**
cs: **Pořadí**
fr: **Tris**
ja: **ソーティング管理**
zh_tw: **排序**

source: Launch the :ref:`sortings dialog <vsf_dialogs>`.
cs: Spustí :ref:`dialog "Pořadí" <vsf_dialogs>`.
fr: Ouvre la :ref:`boite de dialogue des tris <vsf_dialogs>`.
ja: :ref:`ソーティング管理画面 <vsf_dialogs>`\ を起動します。
zh_tw: 啟動:ref:'排序對話器<vsf_dialogs>'.

source: **Filters**
cs: **Filtry**
fr: **Filtres**
ja: **フィルター管理**
zh_tw: **篩選**

source: Launch the :ref:`filters dialog <vsf_dialogs>`.
cs: Spustí :ref:`dialog "Filtry" <vsf_dialogs>`.
fr: Ouvre la :ref:`boite de dialogue des filtres <vsf_dialogs>`.
ja: :ref:`フィルター管理画面 <vsf_dialogs>`\ を起動します。
zh_tw: 啟動:ref:'篩選對話器<vsf_dialogs>' .

source: Same as "Quick Filter" in the :ref:`Filter menu <filter_menu>`.
cs: Odpovídá volbě "Vyhledat" z menu ":ref:`Filtr <filter_menu>`".
fr: Pareil que "Filtre rapide" dans le :ref:`menu Filtre <filter_menu>`.
ja: :ref:`フィルターメニュー <filter_menu>`\ の"簡易フィルター"と同じです。
zh_tw: 根"快速篩選麗" 在:ref:'篩選項目<filter_menu>'.

source: **Fullscreen**
cs: **Celá obrazovka**
fr: **Plein écran**
ja: **フルスクリーン**
zh_tw: **全屏**

source: Click this toolbar button to switch PortaBase to fullscreen mode or back to normal display mode.
cs: Klepnutím na toto tlačítko zobrazíte aplikaci PortaBase na celé obrazovce (displeji) nebo se vrátíte zpět do normálního zobrazení.
fr: Cliquez sur ce bouton pour basculer PortaBase en plein écran ou revenir à l'affichage normal.
ja: PortaBaseを通常表示からフルスクリーン表示に変えます、あるいはその逆。
zh_tw: 點擊這個工具欄上的按鈕切換到全屏模式或PortaBase回到正常顯示模式.
