Repository: jmbowman/portabase
Catalog: resources/help/translations/*/enum_editor.po
Languages: cs, fr, it, ja, zh_tw

source: Enum editor
cs: Editor seznamů
fr: Editeur d'énumérations
it: Editor di enum
ja: 列挙編集画面
zh_tw: 集合編輯器

source: This dialog lets you define the name and list of options for an enum column type. It has a list of the enum's options and the same set of buttons as most of the other editor dialogs:
cs: Tento dialog umožňuje vytvořit pod vybraným jménem vlastní seznam a zadat položky, které bude obsahovat. Vytvořený seznam pak bude k dispozici jako volba při výběru typu sloupce. Dialog Editoru seznamů zobrazuje položky seznamu a tlačítka společná i pro ostatní dialogy editorů:
fr: Cette boite de dialogue vous permet de définir le nom et la liste des options pour une colonne de type énumération. Elle fournit une liste d'option des énumérations et dispose du même jeu de boutons que la plupart des autres boite de dialogue d'édition :
it: Questa finestra di dialogo permette di definire il nome e la lista di opzioni per il tipo di colonna enum. Contiene una lista delle opzioni per l'enum e lo stesso insieme di pulsanti di molte altre finestre di dialogo:
ja: このダイアログでは列挙型フィールドタイプの名前と、それに含まれる列挙値を定義することができます。このダイアログには列挙値のリストと、他の編集ダイアログの大半と同じボタンのセットがあります:
zh_tw: 此對話盒會顯示一個集合欄位型別的名稱以及內容。它會列出此集合的項目清單，同時也擁有與多數其他編輯器對話盒相同的按鈕：

source: **Add**
cs: **Přidat**
fr: **Ajouter**
it: **Aggiungi**
ja: **作成**
zh_tw: **新增**

source: Add a new option; a dialog will appear for you to enter the option text into.
cs: Přidá novou položku seznamu; nově otevřený dialog umožňuje zadat text položky.
fr: Ajoute une nouvelle option ; une boite de dialogue s'affichera afin de vous permettre de saisir le texte de l'option.
it: Aggiunge una nuova opzione; appare una finestra di dialogo in cui inserire il testo dell'opzione.
ja: 新しい列挙値を追加します; 列挙値にする文字列を入力するためのダイアログが表示されます。
zh_tw: 新增一個項目; 你可以使用出現的對話盒來輸入此項目的內容。

source: **Edit**
cs: **Editovat**
fr: **Modifier**
it: **Modifica**
ja: **編集**
zh_tw: **編輯**

source: Change the text of an existing enum option. All existing uses of this option will be updated to the new text.
cs: Umožní editaci již existující položky seznamu. Provedenou změnou budou dotčeny všechny výskyty dané položky ve stávajících záznamech.
fr: Change le texte d'une option d'énumération existante. Toutes les utilisations existantes de cette option seront mises à jour avec le nouveau texte.
it: Modifica il testo di un'opzione enum già esistente. Tutti gli usi già esistenti per l'opzione verranno aggiornati con il nuovo testo.
ja: 既存の列挙値を編集します。この列挙値を使っているものは全て新しい文字列で更新されます。
zh_tw: 更改現存項目的內容。所有原先使用此項目的欄位資料會自動更新為新的內容。

source: **Delete**
cs: **Smazat**
fr: **Supprimer**
it: **Elimina**
ja: **削除**
zh_tw: **刪除**

source: Delete the currently selected option. A dialog will ask you to pick the value to use wherever this option was being used.
cs: Smaže vybranou položku. Přitom budete dotázáni, čím chcete nahradit výskyty mazané položky.
fr: Supprime l'option actuellement sélectionnée. Une boite de dialogue s'affichera pour vous demander de choisir la valeur de substitution partout où cette option a été utilisée.
it: Elimina l'opzione attualmente selezionata. Una finestra di dialogo chiederà di scegliere il valore da usare dove quell'opzione era attualmente usata.
ja: 選択されている列挙値を削除します。この列挙値が使用されている個所を、どの値で置き換えるかを尋ねるダイアログが表示されます。
zh_tw: 刪除目前選定之項目。你可以使用出現的對話盒選擇用來替代被刪除的項目。

source: **Up**
cs: **Posunout nahoru**
fr: **Monter**
it: **Su**
ja: **上げる**
zh_tw: **往上**

source: Move the currently selected option up one position in the list (and hence in the selection droplist as well).
cs: Posune vybranou položku v přehledu položek seznamu o jednu pozici výše (a stejně tak i v odpovídající rozbalovací nabídce).
fr: Déplace l'option actuellement sélectionnée d'une position vers le haut dans la liste (et par conséquent dans la liste de sélection déroulante également).
it: Sposta una posizione più in alto nella lista (e quindi nella lista delle selezioni) l'opzione attualmente selezionata.
ja: 選択されている列挙値のリスト上での位置を一つ上げます（それに伴って、ドロップリストから選択する時の表示位置も一つ上に来ます）。
zh_tw: 將目前選定項目往上移動一個位置 (在下拉式清單中的位置也會隨之改變)。

source: **Down**
cs: **Posunout dolů**
fr: **Descendre**
it: **Giù**
ja: **下げる**
zh_tw: **往下**

source: Move the currently selected option down one position in the list (and hence in the selection droplist as well).
cs: Posune vybranou položku v přehledu položek seznamu o jednu pozici níž (a stejně tak i v odpovídající rozbalovací nabídce).
fr: Déplace l'option actuellement sélectionnée d'une position vers le bas dans la liste (et par conséquent dans la liste de sélection déroulante également).
it: Sposta una posizione più in basso nella lista (e quindi nella lista delle selezioni) l'opzione attualmente selezionata.
ja: 選択されている列挙値のリスト上での位置を一つ下げます（それに伴って、ドロップリストから選択する時の表示位置も一つ下に来ます）。
zh_tw: 將目前選定項目往下移動一個位置 (在下拉式清單中的位置也會隨之改變)。

source: Just below the enum name are more buttons which allow you to change the list of options:
cs: Bezprostředně pod jménem seznamu nalezneme tlačítka umožňující nakládání s položkami seznamu:
fr: Juste dessous le nom de l'énumération il y a des boutons supplémentaires qui vous permettent de modifier la liste des options :
it: Subito al di sotto del nome dell'enum, ci sono altri pulsanti che permettono di modificare la lista delle opzioni:
ja: 列挙名のすぐ下にはオプションの一覧を変更するためのボタンがあります:
zh_tw: 在集合名稱正下方的按鈕可以用來更改項目清單的內容：

source: **Sort**
cs: **Seřadit**
fr: **Trier**
it: **Ordina**
ja: **ソート**
zh_tw: **排序**

source: Sort the options in alphabetical order. Click the button again to reverse the sorting order.
cs: Seřadí položky dle abecedy. Dalším klepnutím na toto tlačítko změníte směr řazení.
fr: Trie les options dans l'ordre alphabétique. Recliquez sur le bouton pour inverser l'ordre de tri.
it: Dispone le opzioni in ordine alfabetico. Clicca di nuovo sul pulsante per invertire l'ordine.
ja: オプションをアルファベット順に並べます。逆順に並べるには、もう一度ボタンをクリックします。
zh_tw: 依照字母順序將項目加以排序。再按一下則變成相反順序。

source: **Import**
cs: **Importovat**
fr: **Importer**
it: **Importa**
ja: **インポート**
zh_tw: **匯入**

source: Add options from a text file; this file should have each option on a separate line. Options in the file which are already in the enum will not be duplicated.
cs: Přidá do vybraného seznamu nové položky z textového souboru; tento soubor musí obsahovat položky oddělené odřádkováním. Položky textového souboru, které jsou již v seznamu obsaženy, nebudou duplikovány.
fr: Ajoute des options à partir d'un fichier texte ; dans ce fichier les options doivent être sur des lignes distinctes.
it: Aggiungi opzioni da un file di testo; questo file deve contenere ciascuna opzione su una riga a sé, Le opzioni nel file già presenti nell'enum non verranno duplicate.
ja: テキストファイルからオプションを追加します; このファイルには、1行に1オプションを書きます。
zh_tw: 由文字檔新增項目；此檔案每一行只能有一個項目。集合中已有的項目不會重複輸入。

source: **Export**
cs: **Exportovat**
fr: **Exporter**
it: **Esporta**
ja: **エクスポート**
zh_tw: **匯出**

source: Create a text file listing the current enum options, one on each line.
cs: Vytvoří textový soubor obsahující položky vybraného seznamu (každou na novém řádku).
fr: Crée un fichier texte à partir des options de l'énumération courante, une sur chaque ligne.
it: Crea un file di testo che elenca le correnti opzioni di enum, una per riga.
ja: 各行に１件ずつの形で、現在の列挙選択肢をリストしたテキストファイルを生成します。
zh_tw: 將目前集合的項目會出成一個文字檔；其格式為一行一個項目。

source: Click "OK"/"Done" to accept any changes that were made or cancel out of the dialog to leave the options unchanged (or cancel adding a new enum).
cs: Klepnutím na "OK" přijmete provedené změny, klepnutím na "Zrušit" či křížek pro uzavření dialogu ponecháte položky beze změny (nebo zrušíte vytvoření nového seznamu).
fr: Cliquez sur "OK"/"Fait" pour accepter les modifications ou annuler la boite de dialogue pour laisser les options inchangées (ou annuler en ajoutant une nouvelle énumération).
it: Clicca su "OK"/"Done" per accettare le modifiche fatte, o chiudi la finestra di dialogo per lasciare le opzioni intatte (o non procedere all'aggiunta di un nuovo enum).
ja: 行った変更内容を適用するには"OK"を、列挙値を変更しないで終了する（あるいは新しい列挙値の追加をキャンセルする）にはキャンセルします。
zh_tw: 按下"確定"鈕使變更生效或是按下 "X"/"取消"則保持原狀不變(或是取消新增一個集合)。
