Repository: jmbowman/portabase
Catalog: resources/help/translations/*/enum_manager.po
Languages: cs, fr, it, ja

source: Enum manager
cs: Správce seznamů
fr: Gestionnaire d'énumérations
it: Gestione enum
ja: 列挙管理画面

source: PortaBase supports enum (enumeration) column types, in which each value in the column is one of a set of possible string values. The enum manager dialog lets you create, edit, delete, and change the listing order of these enums.
cs: PortaBase podporuje používání uživatelského seznamu jako jednoho z typů datového sloupce, který pracuje pouze s hodnotami z definovaného seznamu. Dialog Správce seznamů Vám umožní přidávat, editovat a mazat uživatelské seznamy a měnit jejich pořadí.
fr: Portabase gère les colonnes de type énumération dans lesquelles chaque valeur peut être une chaîne de caractères sélectionnée dans une liste. La boîte de dialogue du gestionnaire d 'énumérations vous permet de créer, modifier, supprimer et changer l'ordre de ces énumérations.
it: PortaBase supporta il tipo di colonna enum (enumerazione), in cui i valori fanno parte di un insieme di stringhe possibili. La finestra di dialogo gestione enum permette di creare, editare, cancellare e modificare l'ordine in cui questi enum vengono visualizzati.
ja: PortaBaseは列挙型のフィールドタイプをサポートしています。このフィールドの値は選択可能な文字列値のセットの内の一つになります。列挙管理ダイアログを使って、列挙型の作成、編集、削除、表示順の変更ができます。

source: Most of the dialog is occupied by a list of the currently defined enums. There is a row of buttons identical to those in the :ref:`columns editor <columns_editor>`:
cs: Podstatná část dialogu je vyhrazena přehledu již existujících uživatelských seznamů. V dolní části dialogu je řada tlačítek identických jako u :ref:`Editoru sloupců <columns_editor>`\ :
fr: La plus grande partie de la boite de dialogue est occupée par une liste des énumérations actuellement définies. Il y a une ligne de boutons identiques à ceux de :ref:`l'éditeur de colonnes <columns_editor>`:
it: La maggior parte della finestra di dialogo contiene la lista degli enum al momento definiti. C'è una fila di pulsanti identici a quelli nell' :ref:`editor di colonne <columns_editor>`:
ja: ダイアログの大部分は、現在定義されている列挙型の一覧で占められています。画面には、\ :ref:`フォーマット編集画面 <columns_editor>`\ と同様のボタンが一行に並んでいます:

source: **Add**
cs: **Přidat**
fr: **Ajouter**
it: **Aggiungi**
ja: **作成**

source: Launch the :ref:`enum editor <enum_editor>` to define a new enum. Note that the new enum will be added when "OK"/"Done" is clicked in the editor dialog, not when the "OK"/"Done" button is clicked in this dialog.
cs: Spustí :ref:`Editor seznamů <enum_editor>`\ , který umožní vytvořit nový uživatelský seznam. Nový seznam je přidán do přehledu už po potvrzení "OK" v dialogu Editoru seznamů, nikoli až ve Správci seznamů.
fr: Lance :ref:`l'éditeur d'énumérations <enum_editor>` pour définir une nouvelle énumération. Notez que la nouvelle énumération ne sera ajoutée qu'une fois le bouton "OK"/"Fait" aura été cliqué dans la boite de dialogue de l'éditeur et non dans celle-ci.
it: Lancia l' :ref:`editor di enum <enum_editor>` per definire un nuovo enum. Nota: il nuovo enum verrà aggiunto quando si clicca "OK"/"Done" nella finestra di dialogo dell'editor, non quando si clicca il pulsante "OK"/"Done" button in questa finestra di dialogo.
ja: :ref:`列挙編集画面 <enum_editor>`\ を起動し、列挙型を定義します。新しい列挙型は編集ダイアログで"OK"がクリックされた時点で登録されます。ダイアログの"OK"ボタンがクリックされなかった場合は登録されませんのでご注意ください。

source: **Edit**
cs: **Editovat**
fr: **Modifier**
it: **Modifica**
ja: **編集**

source: Launch the enum editor to edit the currently selected enum. As when adding, edits are applied as soon as "OK"/"Done" is clicked in the editor dialog.
cs: Spustí Editor seznamů s otevřeným vybraným uživatelským seznamem. Stejně jako při přidávání nového seznamu jsou i změny při editaci stávajícího seznamu provedeny už po potvrzení "OK" v dialogu Editoru seznamů.
fr: Lance l'éditeur d'énumérations pour modifier l'énumération sélectionnée. De même que pour l'ajout, les modifications ne sont appliquées qu'une fois le bouton "OK"/"Fait" de la boite de dialogue de l'éditeur aura été cliqué.
it: Lancia l'editor di enum per editare l'enum attualmente selezionato. Come per l'inserimento, le modifiche sono applicate quando si clicca "OK"/"Done" nella finestra di dialogo dell'editor.
ja: 列挙編集画面を起動し、選択されている列挙型を編集します。作成の時と同様、編集ダイアログで"OK"がクリックされた時に編集結果が適用されます。

source: **Delete**
cs: **Smazat**
fr: **Supprimer**
it: **Elimina**
ja: **削除**

source: Delete the currently selected enum. If there are columns of this enum type, a dialog will warn you that these would also be deleted and ask if you want to continue. The enum (and any associated colums) will be deleted immediately, not when "OK"/"Done" is clicked.
cs: Smaže vybraný uživatelský seznam. Je-li tento seznam použit v některých datových sloupcích daného souboru, aplikace PortaBase upozorní uživatele na skutečnost, že smazáním vybraného uživatelského seznamu budou smazány také tyto sloupce. Vybraný uživatelský seznam (stejně tak i asociované sloupce) bude smazán ihned, nikoli až po potvrzení "OK".
fr: Supprime l'énumération sélectionnée. S'il y a des colonnes de ce type, une boite de dialogue vous avertira qu'elles seront également supprimées et vous demandera si vous désirez continuer. L'énumération (et les colonnes associées) sera supprimée immédiatement, et non suite au clic sur le bouton "OK"/"Fait".
it: Elimina l'enum attualmente selezionato. Se ci sono colonne di questo tipo di enum, appare una finestra di dialogo che avvisa che anch'esse saranno cancellate, e chiede se vuoi continuare. L'enum (e tutte le colonne associate) sarà cancellato immediatamente, non quando si clicca su "OK"/"Done".
ja: 選択されている列挙型を削除します。この列挙型を使用しているフィールドがある場合、これらも削除される旨の警告が表示され、続けてよいかと訊ねられます。この列挙型（と関連するフィールド）は"OK"がクリックされた時ではなく、即座に削除されます。

source: **Up**
cs: **Posunout nahoru**
fr: **Monter**
it: **Su**
ja: **上げる**

source: Move the currently selected enum up one position in the list (and hence in the column editor's type list as well).
cs: Posune vybraný seznam v přehledu Správce seznamů o jednu pozici výše (a současně také v Editoru seznamů).
fr: Déplace l'énumération sélectionnée vers le haut (et par conséquent dans la liste des types de l'éditeur de colonnes également).
it: Sposta una posizione più in alto nella lista (e quindi nella lista di tipi dell'editor di colonna) l'enum attualmente selezionato.
ja: 選択されている列挙型のリスト上での位置を一つ上げます（それに伴って、フィールド編集画面のタイプリストでの順番もひとつ前に来ます）

source: **Down**
cs: **Posunout dolů**
fr: **Descendre**
it: **Giù**
ja: **下げる**

source: Move the currently selected enum down one position in the list (and hence in the column editor's type list as well).
cs: Posune vybraný seznam v přehledu Správce seznamů o jednu pozici níž (a současně také v Editoru seznamů).
fr: Déplace l'énumération sélectionnée vers le bas (et par conséquent dans la liste des types de l'éditeur de colonnes également).
it: Sposta una posizione più in basso nella lista (e quindi nella lista di tipi dell'editor di colonna) l'enum attualmente selezionato.
ja: 選択されている列挙型のリスト上での位置を一つ下げます（それに伴って、フィールド編集画面のタイプリストでの順番もひとつ後に来ます）。

source: Click "OK"/"Done" to apply any changes made to the enum listing order, or cancel out of the dialog to leave the sequence unchanged (other than any added or deleted enums).
cs: Volbou "OK" potvrdíte změny řazení v přehledu seznamů, volbou "Zrušit" či křížku pro uzavření dialogu ponecháte původní řazení (netýká se přidaných ani smazaných seznamů).
fr: Cliquez sur "OK"/"Fait" pour appliquer tout changement réalisé dans l'ordre de la liste des énumérations ou annulez la boite de dialogue pour laisser la liste inchangée (hormis les énumérations ajoutées ou supprimées).
it: Clicca su "OK"/"Done" per applicare le modifiche fatte all'ordine della lista degli enum, o chiudi la finestra di dialogo per lasciare la successione intatta (a parte gli enum aggiunti o eliminati).
ja: 列挙型の表示順序に行った変更を適用するには"OK"をクリック、表示順を（列挙型の追加および削除の分を除いては）変更せずに終わるにはキャンセルします。
