Repository: jmbowman/portabase
Catalog: resources/help/translations/*/file_selector.po
Languages: cs, fr, it, ja

source: File selector
cs: Menu "Soubor"
fr: Sélecteur de fichier
it: Selettore file
ja: ファイル選択画面

source: Unless the program was launched by clicking on a PortaBase file, the first screen shown will be the file selector. You may choose one of the following options from the "File" menu, toolbar, or main display buttons:
cs: Není-li aplikace PortaBase spuštěna poklepem na asociovaný soubor, nabídne Vám po spuštění nejprve výběr souboru. Klepnutím můžete otevřít libovolný soubor ze zobrazeného přehledu nebo si vybrat některou z následujících voleb menu "Soubor" (případně použít ekvivalentní tlačítko):
fr: A moins que le programme ne soit lancé en cliquant sur un fichier de type Portabase, le premier écran affiché sera le sélecteur de fichier. Vous pouvez choisir l'une des options suivantes depuis le menu "Fichier", la barre d'outils ou les boutons de l'affichage principal :
it: A meno che il programma non sia stato lanciato cliccando su un file PortaBase, la prima schermata mostrata sarà il selettore file. Puoi scegliere una delle opzioni seguenti dal menu "File", dalla toolbar, o dai pulsanti del display principale:
ja: PortaBaseファイルをクリックしてプログラムを起動した時を以外は、最初にファイル選択画面が表示されます。ここで"ファイル"メニュー、ツールバー、や画面のボタンから以下のオプションのいずれかを選択します:

source: **New**
cs: **Nový**
fr: **Nouveau**
it: **Nuovo**
ja: **新規**

source: Create a new file (possibly :ref:`encrypted <encryption>`)
cs: Vytvoří nový soubor (volitelně i :ref:`šifrovaný <encryption>`\ ).
fr: Crée un nouveau fichier (éventuellement :ref:`chiffré <encryption>`)
it: Crea un nuovo file (che può essere :ref:`crittato <encryption>`)
ja: 新しいファイル（\ :ref:`暗号化 <encryption>`\ されたものも可）を作成します。

source: **Open**
cs: **Otevřít**
fr: **Ouvrir**
it: **Apri**
ja: **開く**

source: Open a dialog to select a file to open
cs: Otevře dialog pro výběr souboru, který chcete otevřít.
fr: Affiche une boite de dialogue pour sélectionner le fichier à ouvrir
it: Apre una finestra di dialogo per scegliere un file da aprire
ja: ファイル選択ダイアログで選ぶファイルを開きます。

source: **Open Recent/Recently opened files**
cs: **Naposledy otevřené**
fr: **Ouvrir un fichier récemment ouvert**
it: **Apri recenti/Ultimi file aperti**
ja: **最近使ったファイル**

source: A list of recently opened files; click on one to open that file.
cs: Ze submenu obsahujícího přehled naposledy otevřených souborů klepnutím otevřete vybraný soubor.
fr: Affiche une liste de fichiers récemment ouverts ; cliquez sur celui à ouvrir
it: Elenco degli ultimi file aperti; clicca su uno di essi per aprirlo.
ja: サブメニューで最近使用したファイルが一覧表示され、そのうちの一つをクリックすることで開けます。

source: **Import**
cs: **Importovat...**
it: **Importa**
ja: **インポート**

source: Create a new file (possibly :ref:`encrypted <encryption>`) from the data in an XML or MobileDB file. You will be prompted for the type of file to import, the file to import, then a name for the new file to create. See the PortaBase home page for more information about the XML format used.
cs: Vytvoří nový soubor (volitelně i :ref:`šifrovaný <encryption>`\ ) z dat souboru ve formátu XML či MobileDB. Přitom budete vyzváni k zadání typu importovaného souboru, jména nově vytvářeného souboru a k výběru souboru, který chcete importovat. Na domovské stránce PortaBase naleznete více informací o použitém formátu XML.
fr: Crée un nouveau fichier (éventuellement :ref:`chiffré <encryption>`) à partir de données dans un fichier XML ou MobileDB. Vous seront demandés le type de fichier à importer, le fichier à importer et un nom pour le nouveau fichier à créer. Référez-vous à la page d'accueil de Portabase pour de plus amples informations concernant le format XML utilisé.
it: Crea un nuovo file (che può essere :ref:`crittato <encryption>`) dai dati in un file XML o MobileDB. Ti verrà chiesto il tipo di file da importare, il file da importare, e il nome con cui creare il nuovo file. Vedi la home page di PortaBase per maggiori informazioni sul formato XML usato.
ja: XMLまたはMobileDBファイルから新しいファイル（\ :ref:`暗号化 <encryption>`\ されたものも可）を作成します。まずインポートするファイルのタイプ、次いでインポートするファイル名、最後に作成するファイル名を入力するプロンプトが表示されます。使用されるXMLフォーマットについてはPortaBaseのホームページを参照して下さい。

source: **Preferences**
cs: **Nastavení**
fr: **Préférences**
it: **Preferenze**
ja: **設定**

source: Launch the :ref:`preferences dialog <preferences>`.
cs: Otevře :ref:`dialog "Nastavení" <preferences>`\ .
fr: Affiche :ref:`la boit de dialogue préférences <preferences>`
it: Lancia la :ref:`finestra di dialogo <preferences>`.
ja: :ref:`設定画面 <preferences>`\ を起動します。

source: **Fullscreen**
cs: **Celá obrazovka**
fr: **Plein écran**
it: **Schermata intera**
ja: **フルスクリーン**

source: Click this toolbar button to switch PortaBase to fullscreen mode or back to normal display mode.
cs: Klepnutím na toto tlačítko zobrazíte aplikaci PortaBase na celé obrazovce (displeji) nebo se vrátíte zpět do normálního zobrazení.
fr: Cliquez sur ce bouton de la barre d'outils pour basculer Portabase en mode plein écran ou pour revenir au mode d'affichage normal
it: Clicca su questo pulsante della toolbar per portare la finestra PortaBase a schermata intera oppure riportarla alla dimensione normale.
ja: PortaBaseを通常表示からフルスクリーン表示に変えます、あるいはその逆。

source: **Quit**
cs: **Ukončit**
fr: **Quitter**
it: **Esci**
ja: **終了**

source: Close PortaBase.
cs: Zavře aplikaci PortaBase.
fr: Ferme Portabase
it: Termina PortaBase.
ja: PortaBaseを閉じます。
