Repository: jmbowman/portabase
Catalog: resources/help/translations/*/image_editor.po
Languages: cs, it, zh_tw

source: Image editor
cs: Editor obrázků
it: Editor di immagini
zh_tw: 影像編輯器

source: An Image column stores pictures imported from JPEG or PNG image files. After you select an image file to import into a field in the database, this dialog is shown so you can make minor changes to the copy of the image that will be saved in the database. The top row contains the following controls:
cs: Do sloupce typu obrázek lze importovat obrázky ze souborů ve formátu JPEG či PNG. Po výběru souboru, který má být importován do daného pole databáze, je zobrazen dialog Editoru obrázků. Zde lze s kopií obrázku ukládanou do databáze provést některé změny. Z horní části dialogu může být změněna:
it: Una colonna Immagini contiene immagini importate da file di tipo JPEG o PNG. Dopo aver selezionato un'immagine da importare in un campo nella base dati, viene mostrata questa finestra di dialogo che permette di fare modifiche minori all'immagine che sar√† salvata nella base dati. La riga iniziale contiene i seguenti comandi:
zh_tw: 影像欄位可儲存匯入的JPEG 或 PNG 影像檔案. 在你選擇好了要匯入到資料庫的影像後, 你可看到一個對話盒. 從這裡, 你可選擇儲存這影像的格式. 這對話盒的內容如下:

source: **Width**
cs: **Šířka**
it: **Larghezza**
zh_tw: **寬度**

source: The maximum allowed width of the image (in pixels).
cs: Maximální povolená šířka obrázku (v pixelech).
it: La massima larghezza (in pixel) consentita per l'immagine.
zh_tw: 影像最寬度 (以圖元計).

source: **Height**
cs: **Výška**
it: **Altezza**
zh_tw: **高度**

source: The maximum allowed height of the image (in pixels).
cs: Maximální povolená výška obrázku (v pixelech).
it: La massima altezza (in pixel) consentita per l'immagine.
zh_tw: 影像最高度 (以圖元計).

source: **Rotate**
cs: **Otočení**
it: **Rotazione**
zh_tw: **旋轉**

source: The angle by which to rotate the image (in degrees): 0, 90, 180, or 270.
cs: Úhel, pod kterým má být obrázek natočen (ve stupních): 0, 90, 180 nebo 270.
it: L'angolo (in gradi) di cui ruotare l'immagine: 0, 90, 180, o 270
zh_tw: 影像角度, 0,90, 180 或 270

source: **Refresh**
cs: **Načíst znovu**
it: **Aggiorna**
zh_tw: **刷新**

source: Apply the currently displayed settings and update the image preview accordingly.
cs: Použije vybrané nastavení a podle něj zaktualizuje náhled obrázku.
it: Applica i parametri attualmente mostrati e aggiorna l'anteprima dell'immagine.
zh_tw: 將最新影像設定資料應用到目前正在觀賞的影像裡

source: Click "OK"/"Done" to store the image as it is shown, or cancel out of the dialog to leave the field unchanged.
cs: Klepnutím na "OK" uložíte obrázek tak, jak je právě zobrazen, klepnutím na "Zrušit" či křížek pro uzavření dialogu ponecháte dané pole beze změny.
it: Clicca "OK"/"Fatto" per memorizzare l'immagine come mostrata, oppure cancella la finestra di dialogo per lasciare invariato il campo.
zh_tw: 你可按OK 按鈕貯存如它所示的影像, 或 按"X"/"取消", 維持影像不變

source: Because memory was limited on the Zaurus PDAs for which PortaBase was originally developed, very large pictures will be rejected. JPEG images larger than 6400 x 4800 pixels cannot be imported, and ones larger than 800 x 600 will be shrunk to at most that size. Similarly, PNG images larger than 800 x 600 cannot be imported. These limitations will be removed in a future version of PortaBase, since it is no longer being developed for the Zaurus.
cs: Protože přístroje Zaurus, pro které byla aplikace PortaBase původně vytvořena, disponují jen omezeným množstvím paměti, není možné pracovat s příliš velkými obrázky. Nelze importovat obrázky JPEG s rozměry nad 6400 x 4800 pixelů, obrázky s rozměry nad 800 x 600 budou zmenšeny (maximálně na 800 x 600 pixelů). Podobně není možné importovat obrázky PNG s rozměry nad 800 x 600. Tato omezení budou z příštích verzí aplikace PortaBase odstraněna, neboť aplikace již není pro přístroje Zaurus vyvíjena.
