Repository: jmbowman/portabase
Catalog: resources/help/translations/*/import.po
Languages: cs, fr, ja, zh_tw

source: CSV import
cs: Import dat
fr: Importation CSV
ja: CSVインポート
zh_tw: 匯入CSV檔

source: PortaBase can import rows of data from CSV (Comma-Separated Value) files. This allows you to import data exported from a spreadsheet or another database program. To do this:
cs: Do aplikace PortaBase lze importovat datové záznamy ze souborů CSV (obsahující hodnoty oddělené čárkami). To umožňuje import dat vyexportovaných z tabulkového editoru nebo jiné databázové aplikace. Chcete-li provést import:
fr: PortaBase peut importer des lignes de données à partir de fichiers CSV (valeurs séparées par des virgules). Cela vous permet d'importer des données exportées à partir d'une feuille de calcul ou d'un autre programme de base de données. Pour faire ça:
ja: PortaBaseはCSV（カンマ区切りテキスト）ファイルからデータレコードをインポートすることができます。これにより、表計算や他のデータベースソフトからエクスポートされたデータをインポートすることができます。やり方は以下の通りです:
zh_tw: PortaBase可以由CSV(內容以逗號分隔)檔匯入資料列。這樣你就可以匯入由試算表或其他資料庫程式所產生的資料。步驟如下：

source: Open the PortaBase file you want to import the data into. If you wish to import the data into a new file, create a new file and define a column structure that matches that of the data to be imported.
cs: Otevřete soubor PortaBase do kterého chcete data importovat. Chcete-li importovat data do nového souboru, vytvořte nový soubor a nadefinujte strukturu sloupců odpovídající struktuře dat, která mají být importována.
fr: Ouvrez le fichier PortaBase dans lequel vous souhaitez importer les données. Si vous souhaitez importer les données dans un nouveau fichier, créez un nouveau fichier et définissez une structure de colonnes correspondant à celle des données à importer.
ja: データをインポート先になるPortaBaseファイルを開きます。新規ファイルにインポートしたい時は、あらかじめ新しいファイルを作成し、インポーとするデータに合ったフィールド構造を定義します。
zh_tw: 開啟匯入之資料所要存放的PortaBase檔。如果要將匯入的資料存放在一個新檔中，先新增一個檔案並定義與匯入資料架構相同的欄位結構。

source: From the "File" menu in the :ref:`data viewer <data_viewer>`, select "Import". A file dialog will open which allows you pick the CSV file you want to import from. The CSV file must have the same number of columns as the open database file, and the values in those columns must be appropriate for the specified column types. You may specify the encoding of the text file in order to import non-ASCII characters correctly; the default is UTF-8 (which supports text in many languages), but you may also choose Latin-1 (which is used by most software configured for use primarily with Western European languages).
cs: V :ref:`Prohlížeči dat <data_viewer>` vyberte z menu "Soubor" volbu "Importovat...". Objeví se dialog pro výběr souboru, který zobrazí všechny dostupné soubory CSV. Vyberte soubor, z něhož chcete importovat. Soubor CSV musí obsahovat stejný počet sloupců jako otevřený databázový soubor a hodnoty ve sloupcích musí odpovídat příslušným typům sloupců. Pro zajištění korektního importu znaků neobsažených v ASCII z textového souboru je potřeba definovat kódování. Jako výchozí je použito UTF-8 (podporující texty psané ve většině jazyků), lze však nastavit i Latin-1 (používáte-li textové výstupy např. pouze v angličtině).
fr: Dans le menu "Fichier" du: ref: `visualiseur de données <data_viewer>`, choisissez "Importer". Une boîte de dialogue de fichier s'ouvrira vous permettant de choisir le fichier CSV à importer. Le fichier CSV doit avoir le même nombre de colonnes que le fichier de base de données ouvert et les valeurs de ces colonnes doivent correspondre aux types de colonnes spécifiés. Vous pouvez spécifier le codage du fichier texte afin d'importer correctement les caractères non-ASCII. La valeur par défaut est UTF-8 (qui prend en charge le texte dans de nombreuses langues), mais vous pouvez également choisir Latin-1 (utilisé par la plupart des logiciels configurés pour être utilisés principalement avec les langues d'Europe occidentale).
ja: :ref:`データ表示画面 <data_viewer>`\ の"ファイル"メニューから"インポート"を選びます。ファイルセレクタが現れ、インポートしたいファイルを1つ選択します。CSVファイルは、開かれているデータベースファイルと同じカラム数で、各カラムの値は定義されているカラムのタイプに合っていなければいけません。文字を正しくインポートするためにテキストファイルのエンコーディングを指定することができます。デフォルト設定は多くの言語のテキストをサポート出来るUTF-8ですが、Latin-1を選択することも出来ます。
zh_tw: 在\ :ref:`資料檢視器 <data_viewer>`\ 中的"檔案"選單中，選擇"匯入"。接著一個檔案選取器會顯示所有可用的CSV檔; 你可以從中挑選要匯入的檔案。此CSV檔必須與目的資料庫檔擁有相同數目的欄位，而且欄位值也必須符合指定的欄位型別。你可以指定文字檔的編碼方式以便正確的匯入非ASCII的字元; 預設值是UTF-8(此編碼方式支援許多種語言的文字)，不過你也可以選擇Latin-1(此編碼方式多為西歐國家使用)。

source: The rows in the imported file are added to the database. Rows from other files can be added by repeating this process, or another copy of the same rows can be added by importing the same file again.
cs: Záznamy z importovaného souboru jsou přidány do databáze. Záznamy z jiných souborů lze přidat opakováním tohoto postupu, další kopii stejných záznamů lze přidat opakováním importu stejného souboru.
fr: Les lignes du fichier importé sont ajoutées à la base de données. Des lignes provenant d'autres fichiers peuvent être ajoutées en répétant ce processus, ou une autre copie des mêmes lignes peut être ajoutée en important à nouveau le même fichier.
ja: インポートされるファイル内のレコードがデータベースに追加されます。この手順を繰り返すことで、他のファイルからさらにレコードを追加することも、同じファイルを再度インポートして同じレコードを追加することもできます。
zh_tw: 匯入的資料列被新增至資料庫中。 你可以用相同的方式來匯入其他檔案中的資料列， 或是再次匯入相同的檔案來新增同一份資料列。

source: Notes:
cs: Poznámky:
fr: Remarques:
ja: 備考:
zh_tw: 注意：

source: Boolean fields must have a value of either 0 or 1.
cs: Pole booleánského typu mohou obsahovat jen hodnoty 0 nebo 1
fr: Les champs booléens doivent avoir la valeur 0 ou 1.
ja: 真偽フィールドの値は0か1でなければなりません。
zh_tw: 布林值欄位內容必須是0或1

source: Date fields may be formated as YYYYMMDD, YYYY/MM/DD, YYYY-MM-DD, or YYYY.MM.DD.
cs: Datová pole mohou obsahovat datum ve formátu RRRRMMDD, RRRR/MM/DD, RRRR-MM-DD nebo RRRR.MM.DD
fr: Les champs de date peuvent être au format AAAAMMJJ, AAAA / MM / JJ, AAAA-MM-JJ ou AAAA.MM.DJ.
ja: 日付フィールドはYYYYMMDD、YYYY/MM/DD、YYYY-MM-DD、YYYY.MM.DDのいずれかの形式にします。
zh_tw: 日期欄位格式必須為YYYYMMDD、YYYY/MM/DD、YYYY-MM-DD、或YYYY.MM.DD

source: Time fields may be formated as HH:MM:SS, HH:MM:SS AM, HH:MM, HH:MM AM, or the number of seconds past midnight. Blank or -1 values are interpreted as "None".
cs: Časová pole mohou obsahovat čas ve formátu HH:MM:SS, HH:MM:SS ráno/dop., HH:MM, HH:MM ráno/dop. nebo počet sekund od půlnoci. Prázdné pole či hodnota -1 jsou interpretovány jako chybějící údaj.
fr: Les champs de temps peuvent être au format HH: MM: SS, HH: MM: SS AM, HH: MM, HH: MM AM ou le nombre de secondes après minuit. Les valeurs vides ou -1 sont interprétées comme "Aucune".
ja: 時間フィールドはHH:MM:SS、HH:MM:SS AM、HH:MM、HH:MM AMのいずれかの形式か、00:00からの経過秒にします。空白と-1は"なし"として処理されます。
zh_tw: 時間欄位格式必須為HH:MM:SS、HH:MM:SS AM、HH:MM、HH:MM AM、或是午夜十二點後所經過的秒數。空白或 -1相當於"無"。

source: Calculation fields may be left as 0 or whatever; the actual values will be calculated during import.
cs: Pole výpočtů mohou obsahovat 0 či jiný údaj; aktuální hodnoty budou vypočteny během importu.
fr: Les champs de calcul peuvent être laissés à 0 ou peu importe; les valeurs réelles seront calculées lors de l'importation.
ja: 計算値フィールドは0で残しておきます; 実際の値はインポートの間に計算されます。
zh_tw: 計算字段可能被保留為 0或任何，實際值將被計算在進口。

source: Image fields should contain either nothing (for no image loaded) or the relative or absolute path to a suitable image file.
cs: Pole obrázků by neměla obsahovat nic (nemá-li být načten žádný obrázek) nebo relativní či absolutní cestu k vybranému obrázkovému souboru.
fr: Les champs d'image ne doivent contenir rien (pour aucune image chargée) ni le chemin relatif ou absolu vers un fichier image approprié.
ja: 画像フィールドは空（画像をロードしないのであれば）または適切な画像ファイルへの相対または絶対パスを入れます。
zh_tw: 圖像領域應包含什麼（無圖像加載）或相對或絕對路徑到一個合適的圖像文件。
