Repository: jmbowman/portabase
Catalog: resources/help/translations/*/introduction.po
Languages: cs, fr, it, ja, zh_tw

source: Introduction
cs: Úvodem
it: Introduzione
ja: イントロダクション
zh_tw: 簡介

source: PortaBase is a small database program for creating, browsing, and editing custom tables of data. Typical uses are media inventories, reference charts, TODO lists, shopping lists, etc. Notable features include:
cs: PortaBase je malá databázová aplikace pro vytváření, prohlížení a editaci uživatelských datových tabulek. Typické využití nachází při vedení inventářů médií, přehledů referencí, seznamů úkolů, nákupních seznamů, atd. Mezi významné vlastnosti patří:
fr: Portabase est un petit logiciel de gestion de base de données pour créer, parcourir et mettre à jour des tables de données personnalisées. Il peut être utilisé pour gérer des inventaires, tenir des tableaux de référence, des listes de tâches à faire, des listes de course, etc. Les fonctionnalités importantes sont :
it: PortaBase è un piccolo programma di database per creare, visualizzare ed editare tabelle personalizzate di dati. I suoi usi tipici sono inventari, tabelle di riferimenti, liste di azioni da compiere, liste della spesa, ecc. Tra le caratteristiche principali:
ja: PortaBaseは自分でテーブルを設定し、作成し、表示し、編集することのできる小さなデータベースプログラムです。一般的な用途はメディア一覧、リファレンスチャート、TODOリスト、買い物リスト、などなどです。以下のような機能があります:
zh_tw: PortaBase是一個可以用來新增、瀏覽與編輯任意資料表的小型程式。典型的使用方式包含媒體清單、參考圖表、待辦事項清單、購物清單等等。它包含下列特點：

source: String, Integer, Decimal, Boolean, Note (multi-line text), Date, Time, Calculation, Sequence, Image, and Enum column types
cs: Podpora následujících typů datových sloupců: Řetězec, integer, decimální, booleánský, poznámka (víceřádkový text), datum, čas, výpočet, sekvence, obrázek a uživatelem definovatelný seznam
fr: Colonnes de type chaîne de caractères, entier, décimal, booléen, note (texte multiligne), date, heure, calcul, séquence, image et énumération
it: Tipi di colonna: Stringa, Intero, Decimale, Booleano, Nota (testo su più righe), Data, Ora, Formula, Successione, Immagine, Enumerazione
ja: 文字列、整数値、数値、真偽、ノート(複数行のテキスト)、日付、時刻、計算値、番号、画像、列挙型のフィールドタイプ。
zh_tw: 支援字串、整數、十進數、布林值、多行文字項、日期、時間, 影像 與集合等欄位型別

source: Custom data views (subsets of the columns in any order)
cs: Vytváření uživatelských náhledů (vybraných sloupců v libovolném pořadí)
fr: Vues de données personnalisées (sous-ensemble de colonnes dans n'importe quel ordre)
it: Viste personalizzate (sottoinsiemi delle colonne in ordine a piacere)
ja: カスタムデータビュー(任意のフィールドの組み合わせ)。
zh_tw: 任意的資料景觀(由任何數目的欄位依照任意順序組合而成)

source: Filter the displayed rows using sets of conditions
cs: Filtrování zobrazených záznamů dle definovaných sad podmínek
fr: Filtrer les lignes affichées en utilisant un ensemble de critères
it: Righe da visualizzare filtrabili usando insiemi di condizioni
ja: 複数の条件を組み合せた表示データのフィルター。
zh_tw: 可使用多個條件來進行篩選並顯示結果

source: Sort the rows by any combination of columns, each in ascending or descending order
cs: Vytváření vlastního pořadí záznamů (řazení dle libovolného sloupce či kombinace sloupců s možností stanovit směr řazení pro každý sloupec)
fr: Trier les lignes par quelconque combinaison de colonnes, chacune en ordre ascendant ou descendant
it: Ordinamento delle righe secondo una combinazione qualunque delle colonne, sia in ordine ascendente che discendente
ja: 任意のフィールドに昇順、降順を指定した組み合わせでのソート。
zh_tw: 可依照任意欄位的組合來加以排序，其中每個欄位可指定順序遞增或遞減

source: Good performance even when browsing large tables; the display only loads data as needed
cs: Dobrý výkon i při práci s velkými datovými tabulkami; načítají a zobrazují se vždy jen právě požadovaná data
fr: Bonne performance même lors de la navigation de grandes tables ; à l'affichage seules les données nécessaire sont chargées
it: Buone prestazioni anche visualizzando tabelle grandi: il display carica solamente i dati necessari
ja: 大きなファイルでも問題なく扱える要求時ページング。
zh_tw: 良好的性能，即使瀏覽大型表，顯示只需要加載數據

source: Optional page navigation buttons, with custom number of rows per page
cs: Možnost navigace tlačítky na stránkách v prohlížeči dat (s uživatelem zvoleným počtem záznamů zobrazovaných na jedné stránce)
fr: Page optionnelle de butons de navigation, avec un nombre personnalisé de lignes par page
it: Pulsanti opzionali di navigazione sulla pagina, con un numero selezionabile di righe per pagina
ja: オプションとして、ページあたりのレコード数を指定した状態での、ページナビゲーションボタン。
zh_tw: 可設定每頁顯示幾列，並具有頁面瀏覽鈕

source: Add, delete, rearrange, and rename columns at any time
cs: Možnost kdykoli přidávat, mazat či přejmenovávat sloupce, editovat je a měnit jejich pozici
fr: Ajouter, supprimer, réarranger et renommer les colonnes à n'importe quel moment
it: Aggiunta, eliminazione, riordinamento e ridenominazione delle colonne in ogni momento
ja: 随時フィールドの追加、削除、再編集、リネームが可能。
zh_tw: 任何時刻皆可對欄位進行新增、刪除、重排與重新命名的動作

source: Specify default values for columns
cs: Možnost nastavení výchozích hodnot pro jednotlivé sloupce
fr: Spécifier des valeurs par défaut pour les colonnes
it: Possibilità di specificare valori di default per le colonne
ja: フィールドのデフォルト値指定。
zh_tw: 指定欄位的預設值

source: View summary statistics for columns (total, average, min, max, etc.)
cs: Zobrazování sumárních statistik sloupců (celkem, průměr, minimum, maximum, atd.)
fr: Afficher un résumé des statistiques pour les colonnes (total, moyenne, minimum, maximum, etc...)
it: Statistiche riassuntive per le colonne (totale, media, min, max, ecc.)
ja: フィールドの統計情報（総計、平均、最小、最大など）の表示。
zh_tw: 檢視欄位的統計資訊(加總、平均、最小值與最大值等)

source: Import data from CSV, XML, and MobileDB files
cs: Import dat ze souborů CSV, XML a MobileDB
fr: Importer des données à partir de fichiers CSV, XML et MobileDB
it: Importazione di dati da file CSV, XML e MobileDB
ja: CSV、XML、MobileDBファイルからのデータインポート。
zh_tw: 可匯入CSV、XML與MobileDB格式的檔案

source: Export data to CSV, HTML, and XML files
cs: Export dat do souborů CSV, HTML a XML
fr: Exporter des données vers des fichiers CSV, HTML et XML
it: Esportazione dei dati in formato CSV, HTML e XML
ja: CSV、HTML、XMLへのデータエクスポート。
zh_tw: 外出資料到CSV, HTML, 和XML 檔案

source: Command-line format conversions (to and from XML, to and from CSV, from MobileDB, to HTML)
cs: Podpora konverzí mezi formáty dat použitím terminálu/příkazového řádku (do a z XML, do a z CSV, z MobileDB, do HTML)
fr: Conversions de format en ligne de commande (vers et depuis XML, vers et depuis CSV, depuis MobileDB et vers HTML)
it: Conversioni di formato da riga di comando (da e verso XML, da e verso CSV, da MobileDB, verso HTML)
ja: コマンドラインでの形式変換（XMLとPortaBaseファイルの相互変換、CSVとPortaBaseファイルの相互変換、MobileDBからPortaBaseファイルへの変換、PortaBaseからHTMLファイルへの変換）。
zh_tw: 命令行的格式轉換(去和從 XML, 去和從CSV, 從 mobileDB, 轉到HTML)

source: Print the data grid with view, sorting, and filter applied (not supported on Maemo)
cs: Tisk datových výstupů s použitým náhledem, pořadím a filtrem (nepodporováno na Maemo)
fr: Imprimer les tableaux de données avec application des vues, tris et filtres (non supporté sous Maemo)
it: Stampa della griglia dei dati con applicati vista, ordinamento e filtro (non supportato su Maemo)
ja: ビュー、ソーティング、とフィルターを適用したデータ印刷。（Maemo版以外）
zh_tw: 打印數據網格認為，排序和過濾器適用於（不支持Maemo操作）

source: Fullscreen mode option
cs: Možnost zobrazení na celé obrazovce či displeji
fr: Option mode plein écran
it: Modalità fullscreen
ja: フルスクリーン表示可能
zh_tw: 全屏模式選項

source: Optional data file encryption
cs: Možnost zabezpečení datových souborů šifrováním
fr: Chiffrement optionnel des fichiers de données
it: Crittazione opzionale dei dati
ja: データファイルの暗号化が可能。
zh_tw: 可以選擇的資料檔案加密

source: Unicode support
cs: Podpora Unicode
fr: Support de l'Unicode
it: Supporto Unicode
ja: Unicodeサポート。
zh_tw: 支援Unicode

source: Pick any available font to use throughout the application (not supported on Mac OS X)
cs: Možnost výběru jakéhokoli dostupného písma pro použití v celé aplikaci (nepodporováno na Mac OS X)
fr: Choisissez n'importe quelle police de caractères disponible dans toute l'application (non supporté sous Mac OS X)
it: Possibilità di scegliere per l'applicazione un qualunque font disponibile (non supportato su Mac OS X)
ja: 利用可能な全てのフォントからアプリケーションで使用するものを選択可能。（Mac OS X版以外）
zh_tw: 整體程式作品可以選擇任何一個可以用的字體從一而終(但Mac OS X 不支持)

source: User-specified alternating row background colors (Maemo Fremantle uses colors from the system theme instead)
cs: Uživatelsky definovatelné barvy pozadí pro odlišení sudých a lichých záznamů (přístroje s Maemo Fremantle používají barvy systémového motivu)
fr: Ligne avec couleur de fond alternée, au choix de l'utilisateur (Maemo Fremantle utilise les couleurs spécifiées au niveau du système)
it: Colori di sfondo alternati per riga e specificati dall'utente (tranne per Maemo Fremantle, che usa i colori dal tema di sistema)
ja: レコードのユーザー指定の二色で交互に背景色塗り分け。（Maemo 5ではシステムテーマの色を使います）
zh_tw: 使用者指定交替行背景顏色(Maemo Fremantle 使用系統主題顏色）

source: Simple calculator widget for entering numeric data
cs: Jednoduchá pomůcka - kalkulátor pro zadávání číselných dat
fr: Composant calculatrice simple pour saisir des données numériques
it: Una semplice calcolatrice per inserire dati numerici
ja: 数値データのシンプルな計算方式の入力画面。
zh_tw: 簡單的計算機元件便於輸入數值資料
