Repository: jmbowman/portabase
Catalog: resources/help/translations/*/preferences.po
Languages: cs, fr, zh_tw

source: Preferences dialog
cs: Dialog "Nastavení"
fr: Dialogue Préférences
zh_tw: 偏好設定對話盒

source: This dialog allows you to set your preferences for the PortaBase application. Click "OK"/"Done" to accept the current preferences on all tabs, or cancel out of the dialog to leave them unchanged. The tabs are:
cs: Tento dialog Vám umožní zvolit si nastavení aplikace PortaBase. Klepnutím na "OK"/"Done" potvrdíte předvolby na všech kartách dialogu, klepnutím na "Zrušit" či křížek pro uzavření dialogu ponecháte stávající předvolby nezměněné. Dialog obsahuje tyto karty:
fr: Cette boîte de dialogue vous permet de définir vos préférences pour l'application PortaBase. Cliquez sur "OK" / "Terminé" pour accepter les préférences en cours sur tous les onglets ou annulez la boîte de dialogue pour les laisser inchangés. Les onglets sont:
zh_tw: 此對話盒可用來進行你對PortaBase程式的偏好設定。它包含了下列部分：點擊"確定"/"完成"以接受當前的優惠對所有的標籤，或取消該對話框離開他們不變。該標籤是：

source: Maemo Fremantle doesn't use tabs in this dialog; all preferences are shown in a scrollable list.
cs: Maemo Fremantle v tomto dialogu nepoužívá karty; všechna nastavení jsou zobrazena jako posouvatelný seznam možností.
fr: Maemo Fremantle n'utilise pas les onglets dans cette boîte de dialogue; toutes les préférences sont affichées dans une liste déroulante.
zh_tw: Maemo的Fremantle不使用選項卡在此對話框中，所有的喜好都顯示在一個滾動的名單。

source: General
cs: Všeobecné
fr: Général
zh_tw: 一般事項

source: The "General" tab contains the following options:
cs: Karta "Všeobecné" obsahuje následujícící volby:
fr: L'onglet "Général" contient les options suivantes:
zh_tw: "一般事項"區段中包含下列選項：

source: **Confirm deletions**
cs: **Vyžadovat potvrzení mazání**
fr: ** Confirmer les suppressions **
zh_tw: **刪除前先詢問**

source: Check this to show a confirmation dialog whenever you attempt to delete a row, view, sorting, or filter. This makes it less likely that you will accidentally delete something when you meant to click on something else.
cs: Označte tuto volbu, chcete-li zobrazovat výzvu k potvrzení smazání každého záznamu, náhledu, pořadí či filtru. Snížíte tak riziko nežádoucího smazání něčeho, co byste smazat nechtěli, např. při nechtěném překlepu.
fr: Cochez cette case pour afficher une boîte de dialogue de confirmation chaque fois que vous essayez de supprimer une ligne, une vue, un tri ou un filtre. Cela rend moins probable que vous supprimiez accidentellement quelque chose lorsque vous vouliez cliquer sur quelque chose d'autre.
zh_tw: 勾選此項目則當你要刪除資料列、景觀、排序方式或篩選時會出現一個確認對話盒。如此可以避免不小心誤刪資料。

source: **Allow checkbox edit in data viewer**
cs: **Povolit editaci přepínačů v prohlížeči dat**
fr: ** Autoriser la modification de la case dans la visionneuse de données **
zh_tw: **允許在資料檢視器中編輯核對盒**

source: Check this to allow toggling of boolean values shown in the :ref:`data viewer <data_viewer>` by clicking on the appropriate cell. This makes it more convenient to use PortaBase as a todo list or such, but also makes it easier to accidentally change a data value.
cs: Označení této volby umožní přepínání booleánských hodnot zobrazených v :ref:`Prohlížeči dat <data_viewer>` klepnutím na odpovídající buňku. To usnadní např. práci se seznamem úkolů, současně však zvýší možnost nechtěné změny hodnoty.
fr: Cochez cette case pour autoriser le basculement des valeurs booléennes affichées dans le visualiseur de données: ref: ` <data_viewer>` en cliquant sur la cellule appropriée. Cela facilite l’utilisation de PortaBase en tant que liste de tâches ou autre, mais facilite également la modification accidentelle d’une valeur de données.
zh_tw: 檢點這個讓你能夠切換真或假之值如示範在:ref:'數據流灠＜data_viewer>' 如果點擊在適應格子裡。這讓整體感覺更方便使用PortaBase作為待辦事項列表，但是也讓他更容易

source: **View rows with a single click**
cs: **Zobrazovat záznamy jedním klepnutím**
fr: ** Voir les lignes en un seul clic **
zh_tw: **查看行只需一次點擊**

source: By default, a single click in the data viewer opens the selected row in the :ref:`row viewer <row_viewer>`. Unchecking this option allows rows to be selected without immediately launching a dialog.
cs: Při výchozím nastavení klepnutím na záznam v Prohlížeči dat otevřete vybraný záznam v :ref:`Prohlížeči záznamů <row_viewer>`. Odznačením této volby získáte možnost vybrat záznam bez okamžitého otevření dialogu.
fr: Par défaut, un simple clic dans la visionneuse de données ouvre la ligne sélectionnée dans la visionneuse de lignes: ref: ` <row_viewer>`. Décocher cette option permet de sélectionner les lignes sans lancer immédiatement une boîte de dialogue.
zh_tw: 在默認情況下，單一點擊在數據景觀器裏會把所選的列位開放到列位景觀裡：ref:'列位景觀器＜row_viewer>'. 把選項拿掉時當你選岀一列位時就不會馬上開啟對話錄器

source: **Use small-screen settings on this device**
cs: **Přizpůsobit k práci na zařízení s malým displejem**
fr: ** Utiliser les paramètres de petit écran sur cet appareil **
zh_tw: **使用小屏幕設置此設備上**

source: When checked, PortaBase uses default values for certain settings (such as column width, rows per page, etc.) which are more appropriate for small displays. This can usually be guessed based on the operating system in use, but some netbooks and MIDs running PC operating systems might be better off with the small-screen settings.
cs: Při použití této volby aplikace PortaBase použije výchozí hodnoty některých nastavení (např. šířku sloupce, počet záznamů na stránku, aj.), které se hodí pro malé zobrazovací plochy. Tyto hodnoty lze obvykle předpokládat dle použitého operačního systému, některé netbooky a MID s operačními systémy pro PC však mohou lépe fungovat bez aktivace této volby.
fr: Lorsque cette case est cochée, PortaBase utilise les valeurs par défaut pour certains paramètres (tels que la largeur des colonnes, les lignes par page, etc.), qui conviennent mieux aux petits affichages. Cela peut généralement être deviné en fonction du système d'exploitation utilisé, mais certains netbooks et MID utilisant un système d'exploitation pour PC pourraient être plus avantageux avec les paramètres de petit écran.
zh_tw: 當檢查，PortaBase使用默認值的某些設置（如列寬，行，每頁等），更適合小型顯示器。這通常可以猜到基於操作系統中使用，但有些上網本和MID的個人電腦操作系統上運行可能會更好的小屏幕設置。

source: **Auto-rotate to match device orientation** (Maemo Fremantle only)
cs: **Automaticky otočit dle orientace zařízení** (jen na Maemo Fremantle)
fr: ** Rotation automatique pour correspondre à l'orientation de l'appareil ** (Maemo Fremantle uniquement)
zh_tw: 自動旋轉匹配設備方向**(只適用于Maem Fremantle)

source: When checked, the application will automatically switch between landscape and portrait display, depending on the current orientation of the device.
cs: Při označení této volby aplikace automaticky přepíná mezi zobrazením obsahu na šířku a na výšku podle aktuální orientace zařízení.
fr: Lorsque cette case est cochée, l'application bascule automatiquement entre les modes paysage et portrait, en fonction de l'orientation actuelle du périphérique.
zh_tw: 正常檢視時，應用程式會自動轉換為景觀或肖像展示，它完全依據當前設備方向

source: **Use pages in data viewer**
cs: **Používat stránky v Prohlížeči dat**
fr: ** Utiliser des pages dans la visionneuse de données **
zh_tw: **使用數據查看器中的頁面**

source: Check this to show the navigation bar at the bottom of the data viewer which allows you to specify the number of rows per page and navigate between pages. If unchecked, the navigation bar is hidden and all rows which pass the current filter will be shown in one scrollable list.
cs: Výběr této volby zobrazí v dolní části Prohlížeče dat navigační lištu, která umožňuje přepínání mezi stránkami a kde můžete zadat počet záznamů zobrazených na jedné stránce. Je-li tato volba odznačena, navigační lišta bude skryta a všechny záznamy vyhovující stávajícímu filtru budou zobrazeny v jediném posouvatelném seznamu.
fr: Cochez cette case pour afficher la barre de navigation au bas de la visionneuse de données, qui vous permet de spécifier le nombre de lignes par page et de naviguer entre les pages. Si cette case est décochée, la barre de navigation est masquée et toutes les lignes qui passent le filtre actuel sont affichées dans une liste déroulante.
zh_tw: 請在此顯示的導航欄在底部的數據查看器，允許你指定每頁的行數和瀏覽網頁之間。如果任其發展下去，在導航欄被隱藏，所有通過該行目前的過濾器將被顯示在一個滾動的名單。

source: **Default rows per page**
cs: **Výchozí počet záznamů na stránce**
fr: ** lignes par défaut par page **
zh_tw: **默認每頁行**

source: The default value to use for the maximum number of rows displayed on one page when creating new databases.
cs: Výchozí hodnota maximálního počtu záznamů, které mohou být zobrazeny na jedné stránce nově vytvářených databází.
fr: Valeur par défaut à utiliser pour le nombre maximal de lignes affichées sur une page lors de la création de nouvelles bases de données.
zh_tw: 默認值使用的最大數量的行顯示在一個頁面上創建新的數據庫。

source: **Wrap Notes**
cs: **Zalamovat poznámky**
fr: ** Notes d'emballage **
zh_tw: **多行文字項自動換行**

source: Checking this enables automatic wrapping of text in the Note editor/viewer, avoiding the need to manually enter linebreaks. By default it wraps only at whitespace, but you can change the droplist value to force wrapping at the end of lines whether spaces are present or not. (This is particularly useful for languages like Japanese which tend not to use spaces.)
cs: Označením této volby povolíte automatické zalamování textu v Editoru/Prohlížeči poznámek bez nutnosti ručního vkládání zalomení. Ve výchozím nastavení je text zalamován pouze v mezerách, lze však nastavit vynucené zalamování kdekoli v textu (což může být vhodné u jazyků, které obvykle nepoužívají mezery mezi slovy, např. u japonštiny).
fr: Le fait de cocher cette case active le retour automatique au texte dans l'éditeur / visualiseur de notes, évitant ainsi la saisie manuelle des sauts de ligne. Par défaut, le retour à la ligne est limité aux espaces, mais vous pouvez modifier la valeur de la liste de dépôt pour forcer le retour à la ligne à la fin des lignes, que des espaces soient présents ou non. (Ceci est particulièrement utile pour les langues telles que le japonais qui ont tendance à ne pas utiliser d'espaces.)
zh_tw: 勾選此項目則在多行文字項編輯器/檢視器中會自動換行，不需手動輸入換行符號。預設僅在空白處換行，但是你可以強迫不論是否為空白都在最後一個位置換行。(這對於日文這一類不太使用空白的語言特別有用。)

source: Date and Time
cs: Datum a čas
fr: Date et l'heure
zh_tw: 日期時間

source: The "Date and Time" tab contains the following options:
cs: Karta "Datum a čas" obsahuje tyto volby:
fr: L'onglet "Date et heure" contient les options suivantes:
zh_tw: "日期時間"區段中包含下列選項：

source: **Date format**
cs: **Formát datumu**
fr: **Format de date**
zh_tw: **日期格式**

source: The type of formatting to use for date values in the data viewer, row viewer, etc.
cs: Formátování použité pro datum např. v Prohlížeči dat, Prohlížeči záznamů atd.
fr: Type de formatage à utiliser pour les valeurs de date dans l'afficheur de données, l'afficheur de lignes, etc.
zh_tw: 在資料檢視器、列檢視器等等中使用的日期資料之格式。

source: **Time format**
cs: **Formát času**
fr: **Format de l'heure**
zh_tw: **時間格式**

source: Whether 24 hour times or 12 hour (AM/PM) times should be shown.
cs: Volba mezi 24 hodinovým či 12 hodinovým (Ráno/dopoledne či Odpoledne/večer) zobrazením času.
fr: Que ce soit 24 heures ou 12 heures (AM / PM) doit être indiqué.
zh_tw: 使用24小時制或是12小時制(上午/下午)。

source: **Weeks start on**
cs: **Týden začíná**
fr: ** Les semaines commencent le **
zh_tw: **每星期的第一天是**

source: The first day of the week; this affects the appearance of the date entry dialog.
cs: Nastavení prvního dne v týdnu; tato volba ovlivní vzhled dialogu pro zadávání datumu.
fr: Le premier jour de la semaine; cela affecte l'apparence de la boîte de dialogue de saisie de la date.
zh_tw: 設定每星期的第一天; 此項目會影響日期輸入對話盒的外觀。

source: **Show Seconds for times**
cs: **Zobrazovat sekundy**
fr: ** Afficher les secondes pour les temps **
zh_tw: **顯示秒的時間**

source: This lets you choose whether or not to display the number of seconds for time columns in the data viewer, row viewer, etc.
cs: Označte tuto volbu, chcete-li zobrazovat sekundy ve sloupcích typu čas v Prohlížeči dat, Prohlížeči záznamů atd.
fr: Cela vous permet de choisir d'afficher ou non le nombre de secondes pour les colonnes de temps dans la visionneuse de données, la visionneuse de lignes, etc.
zh_tw: 這可以讓你選擇是否顯示有多少秒的時間列在數據查看器，行瀏覽器，等。

source: Appearance
cs: Vzhled
fr: Apparence
zh_tw: 外貌

source: In the "Font" section of the Appearance tab you can pick any font that is available for use, in any size it is available in. That font will then be used for all text in PortaBase (even after exiting the application and restarting it) until you pick a different one. You may use this if the default font doesn't support unicode characters (rare on modern systems) or to fit more text on the screen. (This option isn't available on Mac OS X, which doesn't seem to like applications using non-standard fonts for the UI.) On Maemo Fremantle, the rows will remain at a finger-friendly height regardless of font size unless the "Adjust row height to match font" option is checked.
cs: V sekci "Písmo" na kartě "Vzhled" lze vybrat jakékoli dostupné písmo a určit jeho velikost pro použití aplikací PortaBase. Vybrané písmo bude používáno pro veškeré texty v aplikaci PortaBase (i po ukončení aplikace a při dalším jejím spuštění), dokud si nezvolíte jiné. Této volby lze využít např. pokud výchozí písmo systému nepodporuje znaky Unicode (na moderních systémech vzácné) nebo chcete-li zobrazit na obrazovce více textu. (Tato volba není dostupná na Mac OS X kvůli problémům koexistence systému a aplikací používajících ve svých rozhraních nestandardní písma.) Na Maemo Fremantle si zobrazované záznamy zachovají výšku umožňující obsluhu prsty bez ohledu na zvolenou velikost písma, není-li aktivována volba "Upravit výšku zobrazeného záznamu dle písma".
fr: Dans la section "Police" de l'onglet Apparence, vous pouvez choisir n'importe quelle police disponible, quelle que soit sa taille. Cette police sera ensuite utilisée pour tout le texte de PortaBase (même après avoir quitté l'application et l'avoir redémarré). jusqu'à ce que vous en choisissiez un autre. Vous pouvez l'utiliser si la police par défaut ne prend pas en charge les caractères Unicode (rare sur les systèmes modernes) ou pour insérer davantage de texte à l'écran. (Cette option n'est pas disponible sur Mac OS X, qui ne semble pas aimer les applications utilisant des polices non standard pour l'interface utilisateur.) Sous Maemo Fremantle, les lignes resteront à une hauteur adaptée au doigt, quelle que soit la taille de la police L'option "Ajuster la hauteur de la ligne à la police" est cochée.
zh_tw: 在"字體"區的外觀顯現卡你能選取任何可以用的字體，任何尺寸。該字體將使用在PortaBase 上的任何文章(甚至應用程式登出後再登入） 直到你選不同字體後。你可以用此字體如杲默認字體不支持Unicode 字型（現代系統很少這現象）或者去適應銀光幕上多種文字。（這選項不能用在MacOS X, 該系統似乎不喜歡應用程式使用不標準字體用在UI 上）在Maemo Fremantle 系統裡，列位表將保持在一指高不管字體尺寸除非"調整列位高度去配合字體" 時選項被確認。

source: The "Row Colors" section contains two buttons which allow you to choose the colors which will be used for the backgrounds of rows in the data viewer, columns editor, view editor, and sorting editor. Each button shows one of the current colors; clicking on one launches a color selection dialog in which you can pick a different color to use.
cs: Sekce "Barvy záznamů" obsahuje dvě tlačítka pro výběr barev, které budou použity jako střídavé barvy pro pozadí lichých a sudých záznamů v Prohlížeči dat, Editoru sloupců, Editoru náhledů a Editoru pořadí. Každé tlačítko zobrazuje jednu z aktuálně použitých barev. Klepnutí na tlačítko otevře dialog pro výběr barvy, kde si můžete vybrat vlastní barvu.

source: This option isn't available on Maemo Fremantle, where the palette is controlled by the system theme. Instead, there is an option to either use the alternating row color from the theme or make all rows the same color; some themes don't have an appropriate color set for this.
cs: Tato volba není dostupná na Maemo Fremantle, kde je barevná paleta závislá na systémovém motivu. V tomto případě lze buď převzít střídavé barvy lichých a sudých záznamů podle použitého motivu nebo použít pro všechny záznamy stejnou barvu; některé motivy neobsahují pro tento účel vhodnou sadu barev.
fr: Cette option n'est pas disponible sur Maemo Fremantle, où la palette est contrôlée par le thème du système. Au lieu de cela, il existe une option pour utiliser la couleur de rangée alternée du thème ou pour rendre toutes les rangées de la même couleur; certains thèmes n'ont pas de couleur appropriée pour cela.
zh_tw: 這個選項不在Maemo Fremantle 系統裡，在那裡彩色版是控制在系統主題上。相反的，還有一個選項可以用來互相改變行列的顏色--那就是用主題或讓紙所有行列都用相同顏色；有些主題沒有設計適合白的色彩給行列使用。

source: The "Clear the recent files list" button clears the history of recently created and opened files, so that none will be listed on the :ref:`file selection screen <file_selector>`. Files opened later will be added to the list as normal.
cs: Tlačítko "Vymazat seznam naposledy otevřených souborů" vymaže historii dříve vytvořených a otevřených souborů, čímž se vyprázdní i :ref:`dialog pro výběr souboru <file_selector>`. Následně otevírané soubory budou normálně přidávány do historie.
fr: Le bouton "Effacer la liste des fichiers récents" efface l'historique des fichiers récemment créés et ouverts, ainsi aucun fichier ne sera répertorié dans l'écran de sélection de fichier: ref: ` <file_selector>`. Les fichiers ouverts ultérieurement seront ajoutés à la liste normalement.
zh_tw: 在＂清除最近檔案列表＂的按鈕將刪除最近建立旳和打開的檔案的歷史，所以設有任何的檔案會列在:ref:'檔案選取銀幕 <file_selector>'. 其後打開了的檔案會如常態加入檔案列表裡。

source: The "Row Colors" section contains two buttons which allow you to choose the colors which will be used for the backgrounds of rows in the data viewer, columns editor, view editor, and sorting editor. The color selected by the second button is also used as the alternate row color in the row viewer. Each button shows one of the current colors; clicking on one launches a color selection dialog in which you can pick a different color to use. There is also a "Reset" button to revert to the system's default colors.
fr: La section "Couleurs des lignes" contient deux boutons vous permettant de choisir les couleurs qui seront utilisées pour l’arrière-plan des lignes dans la visionneuse de données, l’éditeur de colonnes, l’éditeur de vues et l’éditeur de tri. La couleur sélectionnée par le deuxième bouton est également utilisée comme couleur de ligne alternative dans l'afficheur de ligne. Chaque bouton affiche l'une des couleurs actuelles. cliquer sur l’une d’elles ouvre une boîte de dialogue de sélection de couleurs dans laquelle vous pouvez choisir une couleur différente à utiliser. Il existe également un bouton "Réinitialiser" pour revenir aux couleurs par défaut du système.
