Repository: jmbowman/portabase
Catalog: resources/help/translations/*/row_viewer.po
Languages: cs, fr, ja, zh_tw

source: Row viewer
cs: Prohlížeč záznamů
fr: Afficheur de lignes
ja: レコード表示画面
zh_tw: 列檢視器

source: The row viewer is a dialog designed to conveniently see all of the data for one row at a time. Like the row editor, it has the column labels on the left and values on the right. But the values are not editable, and they wrap so you don't have to scroll horizontally to see everything. The complete content of note fields is shown as well, instead of just the first few words. By default, only the columns in the current view are shown (in the view-specified order); to see a different set of columns, select the appropriate view from the droplist at the bottom of the dialog. Pressing the left and right arrows at the bottom of the screen or the left and right arrow keys allows you to navigate between rows in the current view. There are a few other buttons buttons at the bottom of the dialog:
cs: Prohlížeč záznamů je dialog navržený k pohodlnému prohlížení všech údajů vztahujících se k jednomu záznamu současně. Podobně jako u Editoru záznamů i u Prohlížeče záznamů nalezneme v levé části jména sloupců a v pravé je jejich hodnoty, které však nelze editovat. Hodnoty jsou automaticky zalamovány, takže pro zobrazení celého obsahu odpadá potřeba horizontálního posouvání. Je rovněž zobrazen úplný obsah pole poznámka, nejen několik počátečních slov. Jako výchozí jsou zobrazovány jen sloupce zahrnuté v použitém náhledu (v pořadí určeném při vytváření náhledu). Chcete-li vybrat jinou sadu sloupců zvolte požadovaný náhled z rozbalovacího seznamu v dolní části dialogu. Pomocí tlačítek se šipkami v dolní části dialogu či odpovídajícími klávesami se lze pohybovat mezi záznamy v rámci stávajícího náhledu. V dolní části dialogu jsou ještě další tlačítka:
fr: La visionneuse de lignes est une boîte de dialogue conçue pour afficher facilement toutes les données d'une ligne à la fois. Comme l'éditeur de lignes, il a les étiquettes de colonne à gauche et les valeurs à droite. Mais les valeurs ne sont pas modifiables, et elles s’emboîtent pour que vous n’ayez pas à faire défiler horizontalement pour tout voir. Le contenu complet des champs de note est également affiché, au lieu de quelques mots seulement. Par défaut, seules les colonnes de la vue actuelle sont affichées (dans l'ordre spécifié par la vue). pour afficher un ensemble de colonnes différent, sélectionnez la vue appropriée dans la liste déroulante au bas de la boîte de dialogue. Appuyez sur les flèches gauche et droite en bas de l'écran ou sur les touches fléchées gauche et droite pour naviguer entre les lignes de la vue actuelle. Il y a quelques autres boutons au bas de la boîte de dialogue:
ja: レコード表示画面は1レコード内の全データを閲覧するのに便利なようにデザインされたダイアログです。レコード編集画面と同様、左側にはフィールドラベルが、右側にはその値があります。ただし、値を編集することはできず、折り返し表示されますので横方向にスクロールさせなくても全体を見ることができます。ノートの内容は先頭の数語が表示されるのではなく、全文が表示されます。デフォルトでは、現在のビューに含まれているフィールドだけが（ビューで指定された順番で）表示されます; これ以外のフィールドの組み合わせで見るには、画面下部のドロップリストから適当なものを選択します。画面下部の矢印パッドにある左向き、あるいは右向きの矢印（又は矢印キー）を押すと、現在の表示されているレコードを変更することができます。画面下部に他のボタンもいくすかあります:
zh_tw: 列檢視器是一個讓你方便檢視資料列的所有資料的一種對話盒。與列編輯器相同，欄位標簽在左邊而欄位值則在右邊。但是欄位值不可編輯，而且資料會自動換行。多行文字項欄位的內容會完整顯示，而非只顯示前幾個字。按一下選畫面底部的左右方向箭頭或是使用鍵盤上的左右方向鍵，即可瀏覽目前景觀中的其他資料列。按 一下畫面底部的按鈕會針對目前資料列啟用列編輯器; 如果你在列編輯器中按下"確定"鈕就會回到資料檢視器，否則會回到列檢視器。本程式提供一具有四個按鈕的工具列來存取常用的操作。他們是：

source: **Edit**
cs: **Editovat**
fr: **Modifier**
ja: **編集**
zh_tw: **編輯**

source: Launch the :ref:`row editor <row_editor>` for the current row; if you click "OK"/"Done" in the row editor you will be taken back to the data viewer, otherwise you will be returned to the row viewer.
cs: Spustí :ref:`Editor záznamů <row_editor>` s otevřeným stávajícím záznamem; klepnutím v Editoru záznamů na "OK"/"Done" se vrátíte zpět do Prohlížeče dat, jinak se vrátíte do Prohlížeče záznamů.
fr: Lancer l'éditeur de lignes: ref: ` <row_editor>` pour la ligne en cours; Si vous cliquez sur "OK" / "Terminé" dans l'éditeur de lignes, vous serez redirigé vers la visionneuse de données. Sinon, vous serez renvoyé à la visionneuse de lignes.
ja: 現在のレコードを対象に\ :ref:`レコード編集画面 <row_editor>`\ を起動します; "OK"をクリックするとデータ表示画面に戻りますし、それ以外であればレコード表示画面に戻ります。
zh_tw: 啟動 :ref:'列位編輯器＜row_editor>'來修改當前的列位；如果你點擊列位編輯器上的"Ok"/"Done" 你將被帶回到數據流灠鎣上，否則你將回到列位流灠器上

source: **Copy Row**
cs: **Kopírovat záznam**
fr: **Copier la ligne**
ja: **コピー**
zh_tw: **複製行**

source: Launch the row editor with a copy of the current row; if you click "OK"/"Done" in the row editor you will be taken back to the data viewer, otherwise you will be returned to the row viewer.
cs: Spustí Editor záznamů s otevřenou kopií stávajícího záznamu; klepnutím v Editoru záznamů na "OK"/"Done" se vrátíte zpět do Prohlížeče dat, jinak se vrátíte do Prohlížeče záznamů.
fr: Lancez l'éditeur de lignes avec une copie de la ligne en cours. Si vous cliquez sur "OK" / "Terminé" dans l'éditeur de lignes, vous serez redirigé vers la visionneuse de données. Sinon, vous serez renvoyé à la visionneuse de lignes.
ja: 現在のレコードのコピーを対象にレコード編集画面を起動します; "OK"をクリックするとデータ表示画面に戻りますし、それ以外であればレコード表示画面に戻ります。
zh_tw: 啟動該行的編輯與複製當前行，如果你點擊“確定”/“完成”行中的編輯中，您將返回到數據瀏覽器。

source: **Delete**
cs: **Smazat**
fr: **Supprimer**
ja: **削除**
zh_tw: **刪除**

source: Delete the shown row.
cs: Smaže zobrazený záznam.
fr: Supprimer la ligne affichée.
ja: 現在のレコードを削除します。
zh_tw: 刪除目前選定之資料行。

source: **Copy Text**
cs: **Kopírovat text**
fr: **Copier le texte**
ja: **テキストコピー**
zh_tw: **複製文本**

source: Copy the currently selected text (if any) to the clipboard. (Not shown in Maemo because dragging motions scroll the display rather than selecting text; copy text from the row editor instead.)
cs: Zkopíruje právě vybraný text (je-li nějaký vybrán) do systémové schránky. (Nezobrazuje se na Maemo, kde tažením posunujete záběr displeje místo výběru textu; text lze kopírovat z Editoru záznamů.)
fr: Copiez le texte actuellement sélectionné (le cas échéant) dans le presse-papiers. (Non visible dans Maemo car les mouvements de déplacement font défiler l'affichage plutôt que de sélectionner du texte; copiez le texte à partir de l'éditeur de lignes.)
ja: 選択されたテキストをクリップボードにコピーする。（Maemo版でドラッグすればテクスト選択ではなくスクロールするおかげで、このボタンは表示されません; テキストをコピーするにはレコード編集画面を使います）
zh_tw: 將當前選定的文本（如果有的話）到剪貼板。（不顯示在Maemo的議案，因為拖滾動顯示，而不是選擇文本;複製文本編輯器而不是從行）。
