Repository: jmbowman/portabase
Catalog: resources/help/translations/*/vsf_dialogs.po
Languages: cs, fr, ja, zh_tw

source: Views, sortings, and filters dialogs
cs: Dialogy "Náhledy", "Pořadí" a "Filtry"
fr: Vues, triages et filtres
ja: ビュー、ソーティング、とフィルター管理画面
zh_tw: 景觀，排序和篩選器對話

source: There are three buttons on the toolbar for launching dialogs to select and manage views, sortings, and filters. These three dialogs are very similar, differing only in the type of item being managed. Each one has the following components:
cs: K výběru a správě náhledů, pořadí a filtrů slouží tři tlačítka na tlačítkové liště. Jimi vyvolané dialogy si jsou velmi podobné, liší se jen typem spravovaných položek. Každý dialog obsahuje tyto součásti:
fr: La barre d'outils comporte trois boutons permettant de lancer des boîtes de dialogue permettant de sélectionner et de gérer des vues, des tris et des filtres. Ces trois boîtes de dialogue sont très similaires et ne diffèrent que par le type d'élément géré. Chacun a les composants suivants:
ja: ツールバーにはビュー、ソティング、とフィルターを管理する画面を起動させる三つのボタンがあります。この三つの画面はほぼ同じで、違うのは管理する項目の種類だけ。どれにも以下があります:
zh_tw: 有三個按鈕在工具欄上開展對話的選擇和管理的景觀，排序，和篩選器。這三個對話非常相似，只是在不同類型的項目被管理。每一個有以下內容：

source: **Current View/Sorting/Filter**
cs: **Stávající náhled/pořadí/filtr**
fr: ** Vue actuelle / Tri / Filtre **
ja: **使っているビュー／ソーティング／フィルター**
zh_tw: **當前景觀/排序/篩選**

source: The name of the currently selected item. If this is one of the pre-defined items such as "All Columns", "Selected Column", "All Rows", or "Quick Filter", the edit and delete buttons are disabled.
cs: Jméno právě vybrané položky. Jde-li o některou z předdefinovaných položek, např. "Všechny sloupce", "Vybraný sloupec", "Všechny záznamy" či "Vyhledat", tlačítka pro editaci a smazání nejsou aktivní.
fr: Le nom de l'élément actuellement sélectionné. S'il s'agit de l'un des éléments prédéfinis tels que "Toutes les colonnes", "Colonne sélectionnée", "Toutes les lignes" ou "Filtre rapide", les boutons Modifier et Supprimer sont désactivés.
ja: 現在選択された項目の名前。"全てのフィールド", "選択したフィールド", "全てのレコード", "簡易フィルター"みたいな変更不能な項目の場合、編集と削除のボタンは押せません。
zh_tw: 名稱當前選定的項目。如果這是一個預先定義的項目，如"所有列"，"選定的列"，"所有行"，或"快速篩選器"，編輯和刪除按鈕被禁用。

source: **Edit**
cs: **Editovat**
fr: **Modifier**
ja: **編集**
zh_tw: **編輯**

source: This button, to the right of the selected item name, launches the :ref:`view editor <view_editor>`, :ref:`sorting editor <sorting_editor>`, or :ref:`filter editor <filter_editor>` to modify the currently selected item. If the edit dialog is accepted, the changes will be immediately applied and you will be returned to the :ref:`data viewer <data_viewer>`.
cs: Toto tlačítko, které je umístěno vpravo od jména vybrané položky, spustí :ref:`Editor náhledů<view_editor>`, :ref:`Editor pořadí<sorting_editor>` či :ref:`Editor filtrů <filter_editor>` s možností změny právě vybrané položky. Po odsouhlasení změn v editačním dialogu jsou změny ihned provedeny a uživatel je navrácen do :ref:`Prohlížeče dat <data_viewer>`.
fr: Ce bouton, à droite du nom de l'élément sélectionné, lance l'éditeur de vues: ref: ` <view_editor>`, : ref: `éditeur de tri<sorting_editor>`, ou: ref: `éditeur de filtres <filter_editor>` pour modifier l'élément actuellement sélectionné. Si la boîte de dialogue d'édition est acceptée, les modifications seront immédiatement appliquées et vous serez renvoyé à la visionneuse de données: ref: ` <data_viewer>`.
ja: 現在選択された項目の名前の右にあるこのボタンはその項目を編集するために\ :ref:`ビュー編集画面 <view_editor>`\ 、\ :ref:`ソーティング編集画面 <sorting_editor>`\ 、あるいは\ :ref:`フィルター編集画面 <filter_editor>`\ を起動します。その画面の設定を適用すれば\ :ref:`データ表示画面 <data_viewer>`\ に戻ります。
zh_tw: 這按鈕，在已選的項目名字的右方，發動這：ref:'流灠編輯器<view_editor>', :ref:'排序編輯器＜sorting_editor>',或:ref:'過濾編輯器＜filter_editor>' 用來修飾當前聽所選的項目。如果編輯對話被接受，則你的修改馬上被應用而且你將回到:ref:'數據流灠器＜data_viewer>'.

source: **Delete**
cs: **Smazat**
fr: **Supprimer**
ja: **削除**
zh_tw: **刪除**

source: This button, to the right of the edit button, deletes the curently selected item. You will be returned to the data viewer with the default item of that type selected and applied (there is no default sorting, so after deleting a sorting the rows will not be sorted).
cs: Toto tlačítko, které je umístěno vpravo od tlačítka pro editaci, smaže právě vybranou položku. Uživatel je navrácen do Prohlížeče dat s vybranou a použitou výchozí položkou daného typu (protože není definováno žádné výchozí pořadí, po smazání požadí zůstanou záznamy neseřazeny).
fr: Ce bouton, à droite du bouton Modifier, supprime l’élément actuellement sélectionné. Vous serez renvoyé à la visionneuse de données avec l'élément par défaut de ce type sélectionné et appliqué (il n'y a pas de tri par défaut; ainsi, après la suppression d'un tri, les lignes ne seront pas triées).
ja: 編集ボタンの右にあるこのボタンを押せば、現在選択された項目は削除されます。デフォルトの項目を選択して、データ表示画面にもどります（デフォルトソーティングはないので、ソーティング削除の場合ソート順のない状態に戻ります）。
zh_tw: 此按鈕，在右邊的編輯按鈕，刪除當前所選項目。您將返回到數據查看器的默認這種類型的項目選擇和應用（沒有默認排序，所以刪除了一個排序的行不會被排序）。

source: **New View/Sorting/Filter**
cs: **Nový náhled/pořadí/filtr**
fr: ** Nouvelle vue / tri / filtre **
ja: **ビュー／ソーティング／フィルター作成**
zh_tw: **新 景觀/排序/篩選**

source: This button, below the name of the currently selected item, launches the view editor, sorting editor, or filter editor in order to create a new item of the appropriate type. If such an item is created, it will be set as current and you will be returned to the data viewer.
cs: Toto tlačítko, které je umístěno pod jménem právě vybrané položky, spustí Editor náhledů, Editor pořadí či Editor filtrů s možností vytvořit novou položku daného typu. Je-li nová položka vytvořena, bude nastavena jako aktuální a uživatel bude vrácen do Prohlížeče dat.
fr: Ce bouton, sous le nom de l'élément actuellement sélectionné, lance l'éditeur de vues, l'éditeur de tri ou l'éditeur de filtres afin de créer un nouvel élément du type approprié. Si un tel élément est créé, il sera défini comme courant et vous serez renvoyé à la visionneuse de données.
ja: 現在選択された項目の名前の下にあるこのボタンは新しい項目を作成するためにビュー編集画面、ソーティング編集画面、あるいはフィルター編集画面を起動します。その画面の設定を適用すれば、作成した項目を選択してデータ表示画面に戻ります。
zh_tw: 這個按鈕，下面的名稱目前選定的項目，啟動景觀編輯器，排序編輯，篩選編輯，以創建一個新的項目適當的類型。如果這樣的項目被創建，它將會被設置為當前和您將返回到數據瀏覽。

source: **Views/Sortings/Filters list**
cs: **Seznam náhledů/pořadí/filtrů**
fr: ** Liste Vues / Tri / Filtres **
ja: **ビュー／ソーティング／フィルターの一覧**
zh_tw: **景觀 /排序/篩選列表**

source: Below the "New..." button is a list of the existing items of the appropriate type. Clicking on one of these will apply it and return you to the data viewer. If you wish to edit or delete the item, you can then launch this dialog again to do so.
cs: Pod tlačítkem "Nový..." najdete seznam již existujících položek daného typu. Klepnutím na některou z nich bude tato použita jako aktuální a uživatel se vrátí do Prohlížeče dat. Chcete-li položku editovat či smazat, můžete tak učinit po dalším vyvolání tohoto dialogu.
fr: Sous le bouton "Nouveau ..." se trouve une liste des éléments existants du type approprié. En cliquant sur l'un d'eux, vous l'appliquez et vous revenez à la visionneuse de données. Si vous souhaitez modifier ou supprimer l'élément, vous pouvez alors ouvrir à nouveau cette boîte de dialogue pour le faire.
ja: "...作成"ボタンの下に既存の項目のリストがあります。その中の項目をクリックすれば、その項目を適用してデータ表示画面に戻ります。その項目を編集又は削除したい場合、またこの画面を起動すればいい。
zh_tw: 下面的"新建..."按鈕是一個名單的現有項目的適當的類型。點擊其中一個將適用於它，返回到數據查看器。如果你想修改或刪除的項目，你就可以啟動這一對話再次這樣做。
